{"timestamp": "2025-10-07T09:50:23.491244", "input_query": "Explain the different techniques that have been used to do computational modeling of bank runs", "rewritten_query": "Identify and compare the computational modeling techniques utilized to simulate and analyze bank runs, including the specific methods employed, the key entities modeled (such as depositor behavior, bank resilience, and regulatory interventions), the relationship dynamics captured (e.g., information cascades, contagion effects), and the temporal frameworks or timeframes considered. Highlight any measurable metrics or validation approaches used to evaluate model performance within this context.", "retrieved_chunks": ["[1] Though our modeling of runs as products of liquidity mismatch in bank portfolios is in the spirit of Diamond and Dybvig, our technical approach follows more closely Cole and Kehoe’s (2000) model of self-fulﬁlling debt crises. As with Cole and Kehoe, runs re(cid:31)ect a panic failure to roll over short term loans (as opposed to early withdrawal) and whether these kinds of run equilibria exist depends on macroeconomic fundamentals.1 Some other recent examples of macroeconomic models that consider bank runs include Ennis and Keister (2003), Martin, Skeie, and Von Thadden (2014) and Angeloni and Faia (2013).2 These papers typically incorporate banks with short horizons (e.g. two or 1Our framework thus falls within a general class of macroeconomic models that feature sunspot equilbria to charac- terize business cycles. See for example Farmer (1999). 2See Boissay, Collard, and Smets (2013) for an alternative way to model banking crises that does not involve runs three periods)3. We differ by modeling banks that optimize over an inﬁnite horizon. In addition, bank asset liquidation prices are endogenous and affect whether a sunspot bank run equilibrium exists. Section I presents the model and characterizes the equilibria without and with bank runs. For pedagogical purposes, we start with a baseline where bank runs are unan- ticipated. Section II presents a number of numerical experiments to illustrate how the model can capture both standard ﬁnancial accelerator effects and bank runs, as well as the interaction between the two. In Section III, we describe the extension to the case of anticipated bank runs. Here we present some numerical exercises to illustrate how the mere anticipation of runs can lead to harmful effects on the economy, even if the run does not actually occur. In addition, we show how if we allow for a period of an- ticipation prior to an actual run, the model can produce something like the \"slow run culminating in a fast run\" phenomenon described by Bernanke. We discuss policies that can reduce the likelihood of bank runs in Section IV and directions for further research in the conclusion. The framework is a variation of the inﬁnite horizon macroeconomic model with a banking sector and liquidity risks developed in Gertler and Karadi (2011) and Gertler and Kiyotaki (2011).4 There are two classes of agents - households and bankers - with a continuum of measure unity of each type. Bankers are specialists in making loans and thus intermediate funds between households and productive assets. Households may also make these loans directly, but are less efﬁcient in doing so than banks.", "[2] Modelling contagious bank runs We develop a modelling framework for contagion in financial networks arising from bank runs. We show how interacting channels of contagion, namely funding withdrawals in the interbank network and price-mediated contagion arising from fire sales can turn a bank run on one institution into a systemic crisis. Furthermore, we also model how contagion effects can lead to additional bank runs. Our model allows for a wide range of withdrawal mechanisms both by banks and by external depositors. It can be used for financial stress testing and particularly for analysing implications of different withdrawal mechanisms for systemic risk. We illustrate this in stylised examples and an empirical case study. We find that the extent of systemic risk is highly sensitive to the choices of withdrawal strategies used by the market participants. We also discuss policy implications. Key words: Bank runs, contagion, systemic risk, liquidity freeze, fire sales, financial stress testing. Bank runs pose a significant threat to financial stability. In 2023, Silicon Valley Bank (SVB) collapsed following a bank run during which more than $40 billion in deposits were withdrawn on one day 1 In SVB’s case, it was estimated that around 94% of its deposits were uninsured at the end of 2022 (Barr, 2023, p. 21). While bank runs can have severe consequences for the market participants directly involved, they can also trigger contagion effects that provide a risk to the financial system and the real economy more widely. Jamilov et al. (2024) show empirically based on data of 308 episodes of bank runs between 1800-2023 that there are significant macroeconomic costs associated with systemic bank runs. The first main contribution of our paper is a model for contagion arising from bank runs. This allows us to quantify the possible systemic nature of a bank run. In our model, the initial shock is a bank run, i.e., depositors withdraw (parts of) their deposits at one or several banks. Hence, the shock hits the liabilities side of a bank’s balance sheet. We assume that banks have liquid assets that they would use first to satisfy any withdrawal requests and hence these liquid assets serve as a buffer that can mitigate the effects of a stress event. If this buffer is not large enough to fully absorb the payment requests, we assume that banks use their interbank assets, 1“On March 9, SVB lost over $40 billion in deposits, and SVBFG management expected to lose over $100 billion more on March 10. This deposit outflow was remarkable in terms of scale and scope and represented roughly 85 percent of the bank’s deposit base” Barr (2023). The “run on deposits at SVB appears to have been fueled by social media and SVB’s concentrated network of venture capital investors and technology firms that withdrew their deposits in a coordinated manner with unprecedented speed”, (Barr, 2023, p.24)", "[3] bank failures, few market players and monopoly in some cases. Now as we allow banks to interact with each other the situation changes signiﬁcantly, and our system appears less prone to failures with more market players than witnessed without an interbank In Figure 6.3 we show four independent simulations of our model where banks were allowed to establish links, with parameters c1= 1.1, c2 =1.5, r = 0.5, R = 2, α = 0.7 and Rmin = 0.1. Compared to the cases of no interbank links, we see that more players (banks) are thriving in our society. We see that 2 banks were successfully established out of total 33 banks that tried throughout the society history in the ﬁrst Figure 6.3: Established banks in a 100 with interbank market For more conclusive results we implemented 50 independent simulations1 of the without interbank links (see Appendix (A.1) for the numerical results). In Figure 6.4 below we report the histograms of the number of banks that survived at the end of the simulation for both cases. As we see there is a clear diﬀerence in the distribution market players in the case of no interbank market compared to that where banks were allowed to cooperate. For example, we see fewer monopolies developing in the case of interbank market. On a closer look to the data we ﬁnd that the number of times when a bank becomes dominant in the society (i.e having more than 90% of 1For the numerical comparisons we counted on samples of size 50 independent simulations. While larger sample sizes are to be typically preferable, considering time as well as computational con- strains, this particular choice for the sample sizes reﬂects the rule of thumb in statistical analysis for considering samples of size at least 30 as ‘large’ samples [MBB99]. total clients) is signiﬁcantly smaller in the interbank market case (3 simulations) than when no interbank market exists (8 simulations). Figure 6.4: Histogram of number of banks established by the end of the 80-th period for the 50 simulations, interbank case (upper graph) and no interbank case (lower graph). In our inquiry to examine the diﬀerences we compared the results along three criteria we deemed to reﬂect the basic status of the banking in the society: (i) the", "[4] society (each highlighted with diﬀerent colour) where most of the individuals (about 78%) in the society joined banks at the end. In the next section we consider the more general case where banks face the con- misestimation of their depositors’ needs. Vulnerable to runs, banks need to learn and adapt to survive. Figure 5.3: Banks established after 80 periods in a society of 6400 individuals, without the possibility of a bank run. In the Diamond and Dybvig model [DD00], as well as many models following their footsteps, a bank run occurs when the face value of the deposits becomes higher than the expected value of waiting to withdraw at a later time. Speciﬁcally, the bank run is an equilibrium state in which all depositors (impatient as well as patient agents) withdraw at the intermediate time step because they expect all the others to do the individuals is higher than the expected value of waiting to withdraw at next time step. Accordingly not only impatient depositors withdraw at the intermediate time step (as to be expected by the bank), but so do patient depositors, causing a run in We now consider a more realistic version of our model where banks face the possi- bility of failure using the same intuition as that of Diamond and Dybvig, but adapted Once a bank chooses their estimated proportion of early customers W i k and makes the resource allocation at the beginning of the investing period t2k according to 5.3, it faces the actual ratio W i k of impatient individuals at t2k+1. Two scenarios can k): If the actual proportion is higher than the one based on which the bank made its investment, the bank faces a liquidity problem. Denoting by Ni k the number of customers the bank has at period k, it needs to raise an amount equal to c1(W i k to meet the excess demand for liquidity at time t2k+1. For this, the bank ﬁrst attempts to use its own accumulated reserves (denoted as Ri customers, that is, if Ri k). If these are enough to satisfy all early W i k, then the bank ﬁnds itself in the fortunate situation of having less late customers than previously anticipated. The amount left over is then added to the realized reserves for period k, that is, On the other hand, if the accumulated reserves are not enough to cover the shortfall at time t2k+1, that is if Ri", "[5] More recent literature shows that bank runs can also occur even if banks’ assets are fully liquid. Jiang et al. (2024) show that bank runs can also occur as self-fulfilling solvency runs even when banks have fully liquid assets. They provide empirical evidence using a case study from the failure of Silicon Valley Bank (SVB) in March 2023. They show that “SVB was not an extreme outlier from the perspective of asset losses but was an outlier from the perspective of its liabilities; 92.5% of its deposits were uninsured”, Jiang et al. (2024). Similarly, Amador & Bianchi (2024) also develop a model that shows how bank runs can still occur when banks have only liquid assets, also referring to the failure of SVB as an example where this was the case. Feinstein et al. (2024) show how SVB’s asset composition made it prone to run risk using a framework that captures bank run risk based on balance sheet information. Our approach is related to the model by Liu (2023) which provides a model that combines bank runs and fire sales. In particular, the systemic effect of a bank run is captured by all banks trading in the same illiquid asset, which is also a feature of our model. However, in contrast to our work, the model by Liu (2023) does not include the interbank network and therefore does not model contagion arising in the interbank market and the interplay of contagion in the interbank market and contagion arising from fire sales. There are several game-theoretic approaches to explain bank runs, and also possibly systemic bank runs. For example, Brown et al. (2017) use a game-theoretic framework to analyse under which conditions bank runs at one bank can lead to bank runs at another bank. The role of information plays a key role in this setting and in many other game-theoretic frameworks for contagious bank runs, see also Li & Ma (2022). In our setting, information about market participants etc. can be included in the withdrawal functions both for withdrawals within the network and withdrawals by external depositors. Our work is related to the work by Blickle et al. (2024). They provide empirical evidence based on data from the Great Depression in Germany in 1931 that regular depositors withdraw deposits from all types of banks, whereas “the interbank market collapses for failing banks entirely but continues to function for surviving banks”. Similarly, P´erignon et al. (2018) find in an empirical study2 that “dry-ups predict, but do not cause, future deterioration in bank performance”. In particular, they show that mostly low-quality banks suffer from a funding-dry up and argue that this is in contrast to the idea that these dry-ups are random events. These findings highlight the importance of having a modelling framework for funding withdrawal in the interbank market that is flexible enough that it can include this type of behaviour as well. We develop a pecking order model for funding withdrawals that can achieve this.", "[6] criteria we deemed to reﬂect the basic status of the banking in the society: (i) the number of surviving banks relative to the total number of banks that tried to be established along the society history, (ii) the size of the largest bank in the society, and (iii) the percentage of individuals who joined a bank by the end of the simulation. As expected there is a signiﬁcant diﬀerence in the banking status under these two cases. Banks were more successful where interbank cooperation were allowed compared to the case where banks were working in isolation from one another. Particularly we found that the average number of banks present at the end of the simulation was 4.5 when banks were allowed to interact compared to an average of 3 when they were not allowed to interact. Taking into consideration the number of banks present at the end of the simulation relative to the total number of banks that tried to establish themselves in the society, we ﬁnd that when banks were allowed to interact the percentage is signiﬁcantly2 higher than the case where they were not allowed to interact (19% for the interbank case versus 12% for the no interbank case). On the second criterion we ﬁnd that the average size of the largest banks where banks are not allowed to interact is 64% (size measured as number of agents in the bank relative to the total number of agents in all banks combined) which is signiﬁcantly higher than that witnessed where banks are allowed to interact having the average size of the largest bank as 51%. Interestingly, on the third criterion of bank coverage measured as number of individuals who joined a bank to total society size, the two cases do not record any signiﬁcant diﬀerence (69% where banks are not allowed to interact versus The results so far suggests that allowing banks to interact by forming interbank links strengthened the banking systems with more market players and less failures. On the other hand it had no eﬀect on the banking coverage in the society which is not surprising given that under the two cases banks oﬀer a ﬁxed payoﬀ contract (c1,c2), and individuals in deciding whether to join a bank or not do not consider a priori the possibility of bank failures. Before moving to more interesting patterns of individual behaviour in our society, we examine the performance of our model under diﬀerent", "[7] on actual network structures as a starting point in examining the system stability, provided a rather static picture of the system as manifested by knocking one bank at a time and examining the domino eﬀect, if any, on the network. Such an approach, while providing the ﬂexibility of examining the network, neglected the dynamical nature of the system where banks as well as individual depositors aﬀect each other, In addition, the approach lacked the motivating forces motives for banks to interact with each other. Rather the approach imposed a set of simplifying assumptions to compensate for the lack of such forces, such as the mechanical nature of bank failures by knocking them down and the zero recovery rates associated with their failure. On the other hand we ﬁnd that theoretical studies such as that of Allen and Gale [AG98], by employing an economist’s intuition in addressing bank failures and bank interaction, provided the interacting forces that the empirical based studies lacked. Nevertheless, theoretical studies building on assumptions of optimized behaviour as well as restricting network topologies hindered their generalization to more relevant settings or diﬀerent network structures. Between the static picture provided by the empirically based studies and the simpliﬁed and constrained picture of the theoretical studies, the underlying theory of banking systems implicitly or explicitly reﬂected an unrealistic picture of a manageable and predictable organization. We believe the more appropriate call for the banking theory is to combine the contributions of both streams, the ﬂexibility of the empirical based studies and the quest to understand the underlying dynamical forces in theoretically based studies, in a new direction of Two core modiﬁcations to the assumptions of orthodox economic theory have re- cently been proposed, helping pave the way for such new directions of research. The ﬁrst is an emphasis on inductive rather than deductive thinking. The deductive ap- proach for economic analysis has long been argued against by many economists given that our rationality is essentially bounded (the notion of bounded rationality goes back to Nobel prize laureate Herbert Simon in the 1950s [Sim55]). Recently, it has been explicitly argued that inductive reasoning (as put forward in the El Farol prob- lem by Arthur [Art94]) gives a proper candidate approach or model for our decision making. That approach implied a learning, adaptive process through which market participants form hypotheses given their set of information and experiences, test the", "[8] To date, most macroeconomic models which have tried to capture the effects of bank- ing distress have emphasized ﬁnancial accelerator effects, but have not adequately cap- tured bank runs. Most models of bank runs, however, are typically quite stylized and not suitable for quantitative analysis. Further, often the runs are not connected to fundamen- tals. That is, they may be equally likely to occur in good times as well as bad. Our goal is to develop a simple macroeconomic model of banking instability that fea- tures both ﬁnancial accelerator effects and bank runs. Our approach emphasizes the complementary nature of these mechanisms. Balance sheet conditions not only affect the cost of bank credit, they also affect whether runs are possible. In this respect one can relate the possibility of runs to macroeconomic conditions and in turn characterize how runs feed back into the macroeconomy. For simplicity, we consider an inﬁnite horizon economy with a ﬁxed supply of capital, along with households and bankers. It is not difﬁcult to map the framework into a more conventional macroeconomic model with capital accumulation and employment (cid:31)uctu- ations. The economy with a ﬁxed endowment and a ﬁxed supply of capital, however, allows us to characterize in a fairly tractable way how banking distress and bank runs affect the behavior of asset prices and credit costs. It is then straightforward to infer the implications of the resulting ﬁnancial distress for aggregate economic activity in a setting with variable investment and employment. As in Gertler and Karadi (2011) and Gertler and Kiyotaki (2011), endogenous pro- cyclical movements in bank balance sheets lead to countercyclical movements in the cost of bank credit. At the same time, due to liquidity mismatch, bank runs may be possible. Whether or not a bank run equilibrium exists will depend on two key factors: the condition of bank balance sheets and an endogenously determined asset liquidation price. Thus, a situation can arise where a bank run cannot occur in normal times, but where a severe recession can open up the possibility. Though our modeling of runs as products of liquidity mismatch in bank portfolios is in the spirit of Diamond and Dybvig, our technical approach follows more closely Cole and Kehoe’s (2000) model of self-fulﬁlling debt crises. As with Cole and Kehoe, runs re(cid:31)ect a panic failure to roll over short term loans (as opposed to early withdrawal) and whether these kinds of run equilibria exist depends on macroeconomic fundamentals.1", "[9] Acemoglu et al. (2021) also model a credit freeze, but the motivation in their model is that banks withdraw funding in anticipation of a future default, i.e., they do not lend because they worry that they will not be repaid and not because they suffer a liquidity stress. This is in contrast to our setting in which banks reduce lending because they themselves are under stress. Our work also contributes to the already very rich literature on bank runs. There are two classical views on why bank runs occur (Allen & Gale, 1998): First, they can be random events or self-fulling prophecies, see e.g., Diamond & Dybvig (1983). Second, they can be part of the business cycle Allen & Gale (1998) or problematic macroeconomic fundamentals Bryant (1980). Diamond & Dybvig (1983) have outlined in their pioneering work on bank runs how the maturity transformation that banks provide makes them vulnerable to bank runs. In particular, banks typically provide long-term loans that are funded by short-term deposits. If depositors withdraw their deposits in large quantities, a bank might not have enough liquid assets to satisfy the withdrawal requests by its depositors. Diamond & Dybvig (1983) show that there are multiple equilibria, one of which is a bank run. A bank run is then the outcome of a coordination failure or can also be considered as a self-fulfilling prophecy. This part of the literature does not consider the possible systemic component of a bank run. More recent literature shows that bank runs can also occur even if banks’ assets are fully liquid. Jiang et al. (2024) show that bank runs can also occur as self-fulfilling solvency runs even when banks have fully liquid assets. They provide empirical evidence using a case study from the failure of Silicon Valley Bank (SVB) in March 2023. They show that “SVB was not an extreme outlier from the perspective of asset losses but was an outlier from the perspective of its liabilities; 92.5% of its deposits were uninsured”, Jiang et al. (2024). Similarly, Amador & Bianchi (2024) also develop a model that shows how bank runs can still occur when banks have only liquid assets, also referring to the failure of SVB as an example where this was the case. Feinstein et al. (2024) show how SVB’s asset composition made it prone to run risk using a framework that captures bank run risk based on balance sheet information.", "[10] There is no doubt that additional features can be incorporated to such studies enriching their mechanisms. Nevertheless our claim is that by targeting the question stream of studies essentially lacked the interacting and shaping forces underlying the banking organization and replaced such forces by a set of simplifying assumptions. It is our belief that the study of systemic risk and contagion in a banking system is an In the remainder of the thesis we focus on the issues of banking, banks runs and the interbank formation and explore how in addressing these issues we essentially develop This chapter constitutes the beginning of the second part of our analysis, in particular the introduction of our agent based model. As stated before, our aim is to derive the necessary forces for a dynamical setup of the interbank market. We start with individuals in a pre-banking society and illustrate how their liquidity needs give rise to banking and also to bank runs. In later chapters we show how these forces evolve giving rise to the interbank market. We start our chapter by introducing the Diamond and Dybvig model [DD00] as a widely used model to understand bank runs and other types of ﬁnancial crisis. Unlike their model, instead of assuming individuals always join the banks seeking liquidity, we present our society initially with no banks and illustrate how individuals’ heterogeneous needs gave rise to banks. When considering bank operation and the possibility of facing bank runs, we use the same intuition as that of Diamond and Dybvig but adapted to our agent–based model without any a In the early 1980s, Diamond and Dybvig developed a model [DD00] illustrating why banks choose to issue deposits that are more liquid than their assets and why for the same reason banks are subject to runs. According to their model, individuals have a natural demand for liquidity as they are uncertain about when they need to consume and as such for how long they want to hold assets. It provided the ﬁrst explicit analysis for the liquidity transformation service provided by banks as well as why individuals choose to join banks. The model has 3 times (t = 0,1,2), a single homogeneous consumption good and a productive technology (the illiquid asset) yielding a payoﬀ of R > 1 units of output (consumption good) at time t = 2 per unit invested at time t = 0. On the other hand, if the productive technology is liquidated at t = 1 it yields just the initial investment.", "[11] We have developed a macroeconomic model to integrate the \"macroeconomic\" ap- proach which stresses ﬁnancial accelerator effects with the \"microeconomic\" one which stresses bank liquidity mismatch and runs. We illustrated how combining the two ap- proaches is useful for characterizing banking instability. For example, a recession that constrains bank lending due to conventional ﬁnancial accelerator effects also opens up the possibility of runs due to the associated weakening of balances sheets and reduced liquidity of secondary markets for bank assets. In addition, anticipated bank runs can be harmful even if the runs do not actually occur ex post. Indeed, we argue that allowing for a period of anticipation of a runs prior to an actual run is useful to characterize how the banking distress played out in the Great Recession up to and through the collapse of the shadow banking system. In addition to pursuing aquantitativepolicy analysis, there are two other areas that war- rant further investigation. The ﬁrst involves modeling beliefs of bank run probabilities. Due to the complexity of our model, we have used a simple reduced form approach that relates the probability of run to the fundamentals that determine the existence of a run equilibrium. It would be useful to explore an alternative approach that tightly ties down beliefs. Secondly, the banks we have modeled correspond best to the lightly regulated shadow banking sector which was at the center of the instability of the recent ﬁnancial crisis. In doing so we abstracted from the rest of the ﬁnancial intermediary system. For example, we did not include commercial banks which were tightly regulated and did not experience the same kinds of runs as did the shadow banks. A complete description of the banking crises will require allowing for a richer description of the ﬁnancial system. This appendix describes the global condition for the bank’s optimization problem un- der anticipated bank runs, as laid out in Section III. We show in particular that the local solution described in the text is in fact a global solution. We show that the bank always has the incentive to raise its leverage to the point where the incentive constraint is bind- ing (equation (22) in the text.) It has no incentive restrict leverage in order to be able to operate in the event of bank run when all other banks have failed. First some preliminaries before turning to the optimization problem: When an indi- vidual bank chooses its leverage multiple t, the payoff to depositors per unit in the next period equals t t  1 is the indicator ", "[12] No reserves Rmin = 0: the eﬀect of reducing reserves has a direct eﬀect in reducing banks’ need to interact with each other. In our simulation we notice that reducing the level of reserves to zero worsens the performance of our banks. Compared to the no interbank case (notice that the no interbank case does not depend on the threshold value) the interbank performance is not distinguishable of the percentage of surviving banks. The worsening of performance is seen when we compare the performance of the interbank market with the base case: the percentage of surviving banks is signiﬁcantly reduced from 19% to 15%, the size of the largest bank is signiﬁcantly increased from 51% to 58%, but nevertheless there is no signiﬁcant change on the third criterion of bank coverage (69% compared to the base case of 73%). increasing the reserves threshold directly aﬀects banks’ interactions in increasing their need for interbank links. Again the sit- the no interbank case on all three criteria, it performs worse than the base case. Surviving banks decrease from 19% to 16%, the size of largest bank increased from 51% to 61%, and bank coverage decreased from 73% to 67%. Interestingly and crucially, increasing the threshold to Rmin = 0.2 leads to the same eﬀects observed when the reserves threshold is Rmin = 0: there are no signiﬁcant dif- Through varying diﬀerent parameters one at a time and comparing results between interbank and no interbank cases, we conclude that allowing banks to interact in an interbank market strengthens the system in some instances and in almost all the other cases it performed as well as not allowing them to interact. Looking at the diﬀerent results we see that, as expected, banks perform better oﬀering a lower payoﬀ to individuals and interestingly bank coverage in the society does not get worse (it even gets signiﬁcantly better for the case of no interbank market). On the other hand, oﬀering a higher payoﬀ aﬀects banks dramatically and It is also the one case where allowing the interbank links actually worsens the bank coverage compared to the no interbank", "[13] AUTHOR: Omneia R.H. Ismail, M.Sc. (Twente University/ McMaster University ) The aim of this thesis is to study the role of banking in society and the eﬀect of the interbank market on the performance of the banking system. It starts by reviewing several studies conducted on empirical banking networks and highlighting their salient features in the context of modern network theory. A simulated network resembling the characteristics documented in the empirical studies is then built and its resilience is analyzed with a particular emphasis in documenting the crucial role played by highly It is our belief that the study of systemic risk and contagion in a banking system is an integral part to the study of the economic role of banks themselves. Thus the current work focuses on the fundamentals of banking and aims at identifying the Through an agent–based model, we address the issues of bank formation, bank runs and the emergence of an interbank market. Starting with heterogeneous individuals, bank formation is viewed as an emergent phenomenon arising to meet the needs for investment opportunities in face of uncertain liquidity preferences. When banks work bank failures, banking turns into a monopoly or a market with few players. By equipping banks with their own learning tools and allowing an interbank market to develop, fewer bank failures and a less concentrated banking system are witnessed. In addition, through a scenario analysis, it is demonstrated that allowing banks to interact does not weaken the banking system in almost all the cases, and improves The work is concluded by studying the eﬀects of a banking system on individuals and the economy in what is called social measures. We establish that the eﬀects based on the structure of the society. To work on a PhD degree is a long journey, and coming to its end I would like to express my gratitude to a number of people who shaped my journey. I have been very fortunate working with my supervisor Prof. Matheus Gras- selli, who provided insightful guidance, critical questions throughout my years as his student, and invaluable help with the writing of this thesis. Working under his su- pervision I enjoyed the freedom as a student to think and to pursue my research interest. I am in debt to him for allowing me such freedom and for his patience with I had the best committee members I could have hoped for: Profs. Tim Davidson and Tom Hurd. With time constrains, they kindly gave me the opportunity to work on my topic as an initial trial before judging its validity, then encouraged me as results", "[14] of banks observed in our simulations) see in ﬁgure 6.8. Similarly we ﬁnd that the average percentage of number of successfully established banks reaches as high as 28% in the case of interbank market, signiﬁcantly higher than that when banks are forced to work in isolation (an average percentage of 24%). Compared to the case of homogeneous society with no communities we ﬁnd that the average size of the largest bank is reduced to 47% in the case of no interbank market, insigniﬁcantly diﬀerent from the average percentage of 49% for the interbank case. Similarly on the third criteria of banking coverage there is no signiﬁcant diﬀerence between the two cases (68% where banks are not allowed to interact versus 67% for the interbank case). 3 5 No. of Banks, INTERBANK Figure 6.8: Histogram of number of banks established by the end of the 80-th period for the 50 simulations, interbank case (upper graph) and no interbank case (lower graph). Established preference communities. As demonstrated, the interbank case performed as well as that of the no interbank case in almost all situations, and outperformed the no interbank case in multiple While bank runs and few market players are still witnessed in the banking system when banks are allowed to interact with each other to form an interbank market, there are signiﬁcantly witnessed improvements compared to the case of banks working in iso- lation. Allowing banks to interact resulted in fewer failures and a less concentrated In addition in a scenario analysis of our parameters, we demonstrated that allow- ing banks to interact does not worsen/weaken the banking system in almost all cases, and it did improve the performance on multiple occasions. In particular, the interbank market allowed banks to thrive under the more favourable conditions such as a lower Yet allowing banks to interact on less favourable conditions such as imposing higher payments to be paid to depositors did actually worsen the performance of the system. Finally when considering another more evolved form of society structure where individuals are subject to correlated preference shocks, we found that allowing banks to interact had improved the performance of the banking system when the shocks were less frequent, and did not worsen the performance for the more frequent shocks compared to the case where banks were forced to work in isolation, nor in the case of", "[15] Our framework could be used for financial stress testing and to assess and design policy tools such as designing liquidity buffers etc. For example, the Liquidity Coverage Ratio (LCR) was introduced in Basel III and it specifies a lower bound on the liquid assets that banks should hold so that they can absorb net cash outflows over a 30-day stress scenario. As shown in Ball (2023), the current approach for calculating the Liquidity Coverage Ratio is not pessimistic enough and therefore does not guarantee that banks would survive for 30 days in times of crisis. Our model with interacting contagion channels could help design more pessimistic stress scenarios for this purpose. Our framework could also be used to assess which institutions should be subject to more stringent financial regulation. For example, as reported in FDIC (2023) several rules that currently require institutions to hold a sufficient amount of liquid assets such as the Liquidity Coverage Ratio (LCR) and the Net Stable Funding Ratio (NFSR) only apply to institutions with assets of at least $250 billion. This meant that, for example, Silicon Valley Bank did not have to comply with the LCR and NSFR requirements at the time of its collapse. Our model could be used in stress testing exercise to provide a more in-depth assessment of the resilience of individual institutions and their relevance for systemic risk, and this could be used to inform the decision on whether or not more stringent financial regulation should apply to them. To prove Theorem 2.7 we will use the following lemma. Lemma A.1 (Function Ψ is order-preserving). The function Ψ defined in Definition 2.6 is order-preserving, i.e., for all (˜q, ˜R),(q,R) ∈ [qmin,qmax]× [Rmin,Rmax] with ˜q ≤ q and ˜Ri ≤ Ri for all i ∈ {1,...,N} it holds that Proof of Lemma A.1. We show that Ψ is order-preserving. Let (˜q, ˜R),(q,R) ∈ [qmin,qmax] × [Rmin,Rmax] with ˜q ≤ q and ˜Ri ≤ Ri for all i ∈ {1,...,N}. First, we show that Ψ0(˜q, ˜R) ≤ Ψ0(q,R). To do this, we show that S(˜q, ˜R) ≥ S(q,R). Since q. Since ˜Ri ≤ Ri for all i ∈ {1,...,N}, it holds that − ˜Ri ≥ −Ri and hence ≥ (−Ri)+ q"], "final_answer": "Major strands of recent computational work employ three distinct—but complementary— modelling technologies.\n\n1. Infinite-horizon DSGE / dynamic equilibrium models  \n   • Technique A fully optimising, infinite-horizon DSGE calibrated to banking data; technically it adapts Cole-Kehoe’s self-fulfilling debt-crisis apparatus to a Diamond-Dybvig maturity-mismatch environment [1, 8].  \n   • Key entities Households (depositors), bankers, bank balance sheets, an endogenous liquidation price.  \n   • Relationship dynamics Runs appear as rollover panics (sunspot equilibria) whose existence hinges on bank leverage and the state-contingent asset price; the model also embeds standard financial-accelerator feedbacks from weak balance sheets to real activity [8].  \n   • Time frame Discrete but infinite horizon; experiments include “unanticipated” one-shot runs and “anticipated slow-run-to-fast-run” episodes that mimic the build-up to the 2007-08 crisis [1].  \n   • Metrics / validation Numerical simulations track credit spreads, asset prices and macro aggregates; success is assessed by the model’s ability to reproduce phenomena such as slow-building funding squeezes and the macro damage from merely anticipated runs [1].\n\n2. Network–contagion stress-testing models  \n   • Technique Simulation on an explicit interbank liability network combined with price-mediated fire-sale dynamics; users can program alternative withdrawal rules (“pecking order” funding strategies) [2, 5].  \n   • Key entities Banks, external depositors, interbank claims, liquid-asset buffers.  \n   • Relationship dynamics A withdrawal shock on one bank propagates through (i) funding dries-up along interbank links and (ii) common-asset fire-sale price declines, potentially triggering secondary runs elsewhere [2].  \n   • Time frame Flexible event-driven horizon (hours or days); the SVB case study traces one-day outflows of > $40 bn to illustrate the speed of modern runs [2].  \n   • Metrics / validation Systemic-risk statistics (number of defaults, equity losses) are compared across withdrawal scenarios; empirical external validation comes from matching model outcomes to the SVB episode [2, 5].  The framework is proposed for supervisory stress tests and for calibrating liquidity-buffer rules such as the LCR [15].\n\n3. Agent-based models (ABM) of depositors, banks and the interbank market  \n   • Technique Bottom-up ABM in which heterogeneous individuals learn, form banks endogenously and, later, build interbank links; Monte-Carlo runs (≥ 50 per scenario) generate distributions of outcomes [3, 4, 6, 7, 12, 14].  \n   • Key entities Individuals with stochastic liquidity preferences, banks with reserves and payoff contracts, optional interbank credit lines.  \n   • Relationship dynamics Liquidity mis-estimation triggers Diamond-Dybvig-style runs; interbank cooperation reduces failures and market concentration (fewer monopolies) relative to isolation [3, 6].  Learning and community-level preference shocks capture information cascades across depositors [4, 14].  \n   • Time frame Repeated finite periods (typically 80 rounds; each round contains sub-dates t = 0,1,2 mirroring the classic three-period DD structure) [4].  \n   • Metrics / validation Key performance indicators are (i) percentage of banks surviving, (ii) size of the largest bank, and (iii) population share banked.  Histograms across 50 simulations and parameter sweeps (reserve requirements, payoff levels) quantify resilience gains from interbank links (e.g., survival rises from 12 % to 19 %) [6, 12, 14].\n\nComparative observations  \n• Technique focus: DSGE stresses rational expectations and macro feedback, network models emphasise balance-sheet topology and fire-sale loops, while ABM highlights behavioural heterogeneity and evolutionary learning.  \n• Entities & dynamics: All three include deposit-withdrawal behaviour, but only the network model internalises explicit price-mediated contagion; only ABM endogenises bank entry and interbank-link formation; the DSGE model uniquely endogenises liquidation prices within an equilibrium framework.  \n• Temporal resolution: infinite-horizon (DSGE) versus event-driven days (network) versus multi-round finite horizons (ABM).  \n• Validation: macro calibration and narrative fit (DSGE), empirical case matching and stress-test statistics (network), and Monte-Carlo comparison across controlled scenarios (ABM). Together, these complementary methods give regulators and researchers multiple lenses for quantifying and stress-testing bank-run risk.", "citations": {"7": "not found", "12": "not found", "6": "not found", "5": "not found", "2": "not found", "15": "not found", "14": "not found", "4": "not found", "3": "not found", "8": "not found", "1": "not found"}}
