{"timestamp": "2025-10-07T09:42:26.505681", "input_query": "What was the bank run", "rewritten_query": "What are the structural and molecular mechanisms underlying the biological responses to stress-induced cell membrane destabilization during a \"bank run\" in the context of neurodegenerative disease pathways?", "retrieved_chunks": ["[1] Acemoglu et al. (2021) also model a credit freeze, but the motivation in their model is that banks withdraw funding in anticipation of a future default, i.e., they do not lend because they worry that they will not be repaid and not because they suffer a liquidity stress. This is in contrast to our setting in which banks reduce lending because they themselves are under stress. Our work also contributes to the already very rich literature on bank runs. There are two classical views on why bank runs occur (Allen & Gale, 1998): First, they can be random events or self-fulling prophecies, see e.g., Diamond & Dybvig (1983). Second, they can be part of the business cycle Allen & Gale (1998) or problematic macroeconomic fundamentals Bryant (1980). Diamond & Dybvig (1983) have outlined in their pioneering work on bank runs how the maturity transformation that banks provide makes them vulnerable to bank runs. In particular, banks typically provide long-term loans that are funded by short-term deposits. If depositors withdraw their deposits in large quantities, a bank might not have enough liquid assets to satisfy the withdrawal requests by its depositors. Diamond & Dybvig (1983) show that there are multiple equilibria, one of which is a bank run. A bank run is then the outcome of a coordination failure or can also be considered as a self-fulfilling prophecy. This part of the literature does not consider the possible systemic component of a bank run. More recent literature shows that bank runs can also occur even if banks’ assets are fully liquid. Jiang et al. (2024) show that bank runs can also occur as self-fulfilling solvency runs even when banks have fully liquid assets. They provide empirical evidence using a case study from the failure of Silicon Valley Bank (SVB) in March 2023. They show that “SVB was not an extreme outlier from the perspective of asset losses but was an outlier from the perspective of its liabilities; 92.5% of its deposits were uninsured”, Jiang et al. (2024). Similarly, Amador & Bianchi (2024) also develop a model that shows how bank runs can still occur when banks have only liquid assets, also referring to the failure of SVB as an example where this was the case. Feinstein et al. (2024) show how SVB’s asset composition made it prone to run risk using a framework that captures bank run risk based on balance sheet information.", "[2] Our framework could be used for financial stress testing and to assess and design policy tools such as designing liquidity buffers etc. For example, the Liquidity Coverage Ratio (LCR) was introduced in Basel III and it specifies a lower bound on the liquid assets that banks should hold so that they can absorb net cash outflows over a 30-day stress scenario. As shown in Ball (2023), the current approach for calculating the Liquidity Coverage Ratio is not pessimistic enough and therefore does not guarantee that banks would survive for 30 days in times of crisis. Our model with interacting contagion channels could help design more pessimistic stress scenarios for this purpose. Our framework could also be used to assess which institutions should be subject to more stringent financial regulation. For example, as reported in FDIC (2023) several rules that currently require institutions to hold a sufficient amount of liquid assets such as the Liquidity Coverage Ratio (LCR) and the Net Stable Funding Ratio (NFSR) only apply to institutions with assets of at least $250 billion. This meant that, for example, Silicon Valley Bank did not have to comply with the LCR and NSFR requirements at the time of its collapse. Our model could be used in stress testing exercise to provide a more in-depth assessment of the resilience of individual institutions and their relevance for systemic risk, and this could be used to inform the decision on whether or not more stringent financial regulation should apply to them. To prove Theorem 2.7 we will use the following lemma. Lemma A.1 (Function Ψ is order-preserving). The function Ψ defined in Definition 2.6 is order-preserving, i.e., for all (˜q, ˜R),(q,R) ∈ [qmin,qmax]× [Rmin,Rmax] with ˜q ≤ q and ˜Ri ≤ Ri for all i ∈ {1,...,N} it holds that Proof of Lemma A.1. We show that Ψ is order-preserving. Let (˜q, ˜R),(q,R) ∈ [qmin,qmax] × [Rmin,Rmax] with ˜q ≤ q and ˜Ri ≤ Ri for all i ∈ {1,...,N}. First, we show that Ψ0(˜q, ˜R) ≤ Ψ0(q,R). To do this, we show that S(˜q, ˜R) ≥ S(q,R). Since q. Since ˜Ri ≤ Ri for all i ∈ {1,...,N}, it holds that − ˜Ri ≥ −Ri and hence ≥ (−Ri)+ q", "[3] Our third contribution is the introduction of several tractable measures to assess the con- sequences of initial bank runs. This allows us to analyse and compare different mitigating strategies that banks might use. These measures can also be used as a tool for financial reg- ulation, e.g., to assess and design liquidity buffers, deposit insurance, liquidity provision by a lender of last resort, etc. Our paper is structured as follows. In Subsection 1.1 we discuss relevant related literature. In Section 2 we propose a general model for contagion arising from bank runs. In Section 3 we provide specific examples for withdrawal mechanisms both within the financial network and for withdrawals by external depositors. In Section 4 we introduce several measures that can be used to quantify the level of distress in the system. In particular, we introduce a traffic light measure that quantifies the proportion of nodes in various states of distress. In Section 5 we illustrate how our model can be used for financial stress testing. We provide one stylised example and an example based on empirical data that are publicly available from the Federal Reserve System and the Federal Deposit Insurance Corporation. Finally, Section 6 concludes. The appendix contains all the proofs in Section A and we provide descriptive statistics and more details on the empirical data in Section B. Our paper contributes to the literature on systemic risk in financial networks. While a large part of this literature considers how losses spread through the system, i.e., they spread from borrowers to lenders, see e.g. Eisenberg & Noe (2001), Rogers & Veraart (2013), Cifuentes et al. (2005), Amini et al. (2016a), Battiston et al. (2012), Glasserman & Young (2015) and the survey by Glasserman & Young (2016), we focus on funding withdrawals, i.e., lenders stop lending and hence contagion (in the form of liquidity need) spreads from lenders to borrowers. In contrast to contagion from borrowers to lenders where bankruptcy law determines how contagion spreads, contagion from lenders to borrowers is not subject to formal rules but is determined by preferences of individual institutions. This gives rise to greater flexibility when modelling the contagion process. Mathematically, we will see that there are many similarities in deriving an equilibrium in a setting where the direction of contagion is reversed, but the richer set of rules of possible contagion processes can result in very different outcomes for the system. We will therefore consider different types of strategies that market participants can apply in times of deposit withdrawals, and we study the consequences for the system.", "[4] In Figure 8(a)) the threshold for the leverage is set to κi = 0.03 for all i ∈ N, and we assume that banks do not use excess withdrawals, i.e., λi = 0 for all i ∈ N. In our data set, only one bank (U.S. Bancorp) has an empirical leverage less than 0.03 prior to any price decline of the illiquid asset, and hence this bank will be under run in all 24 stress scenarios. As expected, we find that the proportion of banks in the green category decreases as we increase α and similarly the proportion of nodes in the red category increases. In Figure 8(b)) we increased the threshold for the leverage constraint to κi = 0.06 for all i ∈ N but continue to keep the excess parameter at λi = 0 for all i ∈ N. This increase in κ will cause bank runs to start earlier, i.e., at higher values of the leverage. In our data set, three banks have an empirical leverage less than 0.06 (U.S. Bancorp, State Street, Northern) prior to any decline of the price of the illiquid asset and hence they will be under run in all 24 stress scenarios. As expected, the stress to the system increases as indicated but the sharp decline of the proportion of banks in the green category and the sharp increase of the proportion of banks in the red category. For large values of α, we now also observe some nodes entering the purple category, i.e., they are bankrupt. Recall that in our setting bankruptcy can only occur if the price of the illiquid asset is indeed illiquid, i.e., it is necessary to have α > 0 for this to happen. Finally, in Figure 8(c)) we keep the leverage constraint at κi = 0.06 for all i ∈ N but increase the excess parameter to λi = ¯A(network) for all i ∈ N. This means that banks withdraw more from their counterparties than they actually need and, in fact, they withdraw all their funding. The main consequence of this change is that more nodes move from the red category to the purple category, i.e., the number of bankruptcies increases. 12Recall from our earlier discussion that we need 0 ≤ α ≤ (cid:80)N i=1 A(e),illiquid for the function s (cid:55)→ sexp(−αs) to be non-decreasing on [0,(cid:80)N ]. This implies that the lowest price that can be achieved under this constraint is setting α = (cid:80)N and selling all illiquid assets which results in a price of exp(−1) ≈ 0.367. This is the dashed horizontal line that we also included in the figures for comparison purposes. We find that this lowest price is never reached in our case studies and that in particular the function s (cid:55)→ sexp(−αs) is non-decreasing up to and including the total number of shares of illiquid assets sold in our case study.", "[5] xw t < 1. If an interbank run occurs, all creditor banks receive the same where 0 pro rata share of liquidated assets. As in the case of deposits, we continue to restrict attention to the case where bank runs are completely unanticipated, before turning in a subsequent section to the case of anticipated runs in wholesale funding markets. Due to ﬁnancial market frictions that we specify below, bankers may be con- strained in their ability to raise external funds. To the extent they may be con- strained, they will attempt to save their way out of the ﬁnancing constraint by accumulating retained earnings in order to move toward one hundred percent equity ﬁnancing. To limit this possibility, we assume that bankers have a ﬁnite expected lifetime: Speciﬁcally, each banker of type j (where j = w and r for wholesale and retail bankers) has an i.i.d. probability σj of surviving until the next period and a σj of exiting. This setup provides a simple way to motivate ”divi- probability 1 dend payouts” from the banking system in order to ensure that banks use leverage in equilibrium. Every period new bankers of type j enter with an endowment wj that is received only in the ﬁrst period of life. This initial endowment may be thought of as the start up equity for the new banker. The number of entering bankers equals the number who exit, keeping the total constant. We assume that bankers of either type are risk neutral and enjoy utility from consumption in the period they exit. The expected utility of a continuing banker at the end of period t is given by σj)(σj)i−1 is the probability of exiting at date t + i, and cj t+i is terminal The aggregate shock Zt is realized at the start of t. Conditional on this shock, the net worth of ”surviving” bankers j is the gross return on non-ﬁnancial loans net the cost of deposits and borrowing from the other banks, as follows: t = (Qt + Zt)kj nj where dj positive if bank j borrows and negative if j lends in the interbank market. For new bankers at t, net worth simply equals the initial endowment: t−1 is deposit and bj t−1 is interbank borrowing at t t−1 is Meanwhile, exiting bankers no longer operate banks and simply use their net worth to consume:", "[6] One of the most important challenges facing policy makers in the aftermath of the ﬁnancial crisis is the development of ﬁnancial regulations that can help prevent the recurrence of similar episodes in the future. In this respect, the most relevant inno- vation in the policy landscape has been the introduction of various macroprudential measures in the oversight of ﬁnancial institutions, such as stress tests by central banks and the revised provisions in Basel III. These measures are aimed at ensur- ing that ﬁnancial institutions’ capital is suﬃcient to absorb losses during adverse economic conditions. There is now a signiﬁcant literature that analyzes the impact of capital require- ments on banks for macroeconomic stability (e.g. Christiano and Ikeda (2015), Begenau (2015), Bianchi and Mendoza (2013), Chari and Kehoe (2015)), Gertler, Kiyotaki and Queralto (2012). Most of this literature analyzes how the introduction of leverage restrictions can dampen ﬁnancial accelerator eﬀects by dampening ﬂuc- tuations in bank capital. The need for leverage restrictions, or equivalently capital requirements, stems from an externality that leads individual banks to fail to take into account their own borrowing on the stability as a whole.43 Our framework oﬀers a somewhat diﬀerent perspective on the potential beneﬁts of leverage restrictions. Not only can these restrictions dampen ﬁnancial accelerator eﬀects: Importantly, they can also make the banking system less susceptible to runs. As equation (41) makes clear, a bank run can only happen if the leverage ratio is high enough. Thus, by limiting the leverage ratio suﬃciently, the regulatory authority can in principle eliminate the possibility of a run. The question then is what are the tradeoﬀs. We turn to this issue next. We capture macroprudential policies in our model economy by introducing lever- age restrictions on wholesale banks. In particular, we assume that a ﬁnancial reg- ulator can impose an upper bound on wholesale banks’ leverage, ¯φw. This implies that the eﬀective limit to wholesale banks’ leverage will be given by the smaller be- tween the market imposed limit and the regulatory limit. Accordingly, constraint (22) becomes", "[7] nodes, has exhausted its liquidity buffer completely but does not do fire sales.) j ≥ 0 and (cid:80)N j) = 0. (I.e., it can absorb the stress with its liquidity buffer, and does not withdraw funding from other nodes, and does not do fire sales.) We then consider the proportion of nodes of a particular colour, i.e., Ccolour = |{j ∈ N | j is colour}|/|N| Definition 4.2 (System-wide measures of stress). Let (q∗,R∗) be the greatest fixed point of Ψ. We define the following system-wide measures: (cid:136) We consider three measures that describe the relative composition of the origin of the total – the relative initial bank run (IBR) shock defined by measures the proportion of the total current liabilities that is due to the initial bank runs. – The relative late bank run (LBR) shock defined by – The relative network withdrawal (NW) shock defined by (cid:136) We also consider five relatives measures quantifying the severity of the stress across five – The relative current liabilities defined by Pcurrent liabilities = measure the proportion of (uninsured) liabilities in the system that become due. Hence, they are a relative measure of the magnitude of the liquidity shock. (Here, we exclude the insured deposits.) – The relative network freeze defined by measures the proportion of interbank assets in the system that are withdrawn. – The relative fire sale share number defined by S(q∗,R∗) i=1 A(e),illiquid measures the total number of shares of illiquid asset sold relative to total number of shares of illiquid asset available in the system. – The relative liquidity shortfall defined by i)+ − A(e),illiquid i Li(q∗,R∗) measures the proportion of total current liabilities that cannot be repaid. – The relative banks under late run defined by Punder late bank run = measures the proportion of nodes that are under a late bank run. 5 Applications to financial stress testing We will now illustrate how our modelling framework can be used in financial stress testing. First, we consider a stylised example. Second, we consider an example based on empirical data. We consider a network with three banks. Figure 2 shows the network of interbank liabilities L. Figure 2: Stylised example of a bank run on Bank 2. The orange edges (L12 = 1 and L32 = 1.1) indicate the interbank assets of Bank 2 and hence, these are the edges along which Bank 2 can withdraw funding from other banks.", "[8] Modelling contagious bank runs We develop a modelling framework for contagion in financial networks arising from bank runs. We show how interacting channels of contagion, namely funding withdrawals in the interbank network and price-mediated contagion arising from fire sales can turn a bank run on one institution into a systemic crisis. Furthermore, we also model how contagion effects can lead to additional bank runs. Our model allows for a wide range of withdrawal mechanisms both by banks and by external depositors. It can be used for financial stress testing and particularly for analysing implications of different withdrawal mechanisms for systemic risk. We illustrate this in stylised examples and an empirical case study. We find that the extent of systemic risk is highly sensitive to the choices of withdrawal strategies used by the market participants. We also discuss policy implications. Key words: Bank runs, contagion, systemic risk, liquidity freeze, fire sales, financial stress testing. Bank runs pose a significant threat to financial stability. In 2023, Silicon Valley Bank (SVB) collapsed following a bank run during which more than $40 billion in deposits were withdrawn on one day 1 In SVB’s case, it was estimated that around 94% of its deposits were uninsured at the end of 2022 (Barr, 2023, p. 21). While bank runs can have severe consequences for the market participants directly involved, they can also trigger contagion effects that provide a risk to the financial system and the real economy more widely. Jamilov et al. (2024) show empirically based on data of 308 episodes of bank runs between 1800-2023 that there are significant macroeconomic costs associated with systemic bank runs. The first main contribution of our paper is a model for contagion arising from bank runs. This allows us to quantify the possible systemic nature of a bank run. In our model, the initial shock is a bank run, i.e., depositors withdraw (parts of) their deposits at one or several banks. Hence, the shock hits the liabilities side of a bank’s balance sheet. We assume that banks have liquid assets that they would use first to satisfy any withdrawal requests and hence these liquid assets serve as a buffer that can mitigate the effects of a stress event. If this buffer is not large enough to fully absorb the payment requests, we assume that banks use their interbank assets, 1“On March 9, SVB lost over $40 billion in deposits, and SVBFG management expected to lose over $100 billion more on March 10. This deposit outflow was remarkable in terms of scale and scope and represented roughly 85 percent of the bank’s deposit base” Barr (2023). The “run on deposits at SVB appears to have been fueled by social media and SVB’s concentrated network of venture capital investors and technology firms that withdrew their deposits in a coordinated manner with unprecedented speed”, (Barr, 2023, p.24)", "[9] 15Our setup bears some resemblance to Holmstrom and Tirole (1997), which has non-ﬁnancial ﬁrms that face costs in raising external funds from banks that in turn face costs in raising deposits from households. In our case it is constrained wholesale banks that raise funds from constrained retail banks. In the previous section we described the diﬀerent layers of the wholesale sector, including origination, securitization and funding. For tractability, in our model we consolidate these various functions into a single type of wholesale bank. Overall, our model permits capturing ﬁnancial stress in wholesale funding markets which was a key feature of the recent ﬁnancial crisis. There are three classes of agents: households, retail banks, and wholesale banks. There are two goods, a nondurable good and a durable asset, ”capital.” Capital does not depreciate and the total supply of capital stock is ﬁxed at K. Wholesale and retail banks use borrowed funds and their own equity to ﬁnance the acquisition of capital. Households lend to banks and also hold capital directly. The sum of total holdings of capital by each type of agent equals the total supply: where Kw is the amount held by households. t are the total capital held by wholesale and retail bankers and Kh t Agents of type j use capital and goods as inputs at t to produce output and capital at t + 1, as follows: where type j = w, r and h stands for wholesale banks, retail banks, and households, respectively. Expenditure in terms of goods at date t reﬂects the management cost of screening and monitoring investment projects. In the case of retail banks, the management costs might also reﬂect various regulatory constraints. We suppose this management cost is increasing and convex in the total amount of capital, as given by the following quadratic formulation: In addition we suppose the management cost is zero for wholesale banks and highest for households (holding constant the level of capital): This assumption implies that wholesale bankers have an advantage over the other agents in managing capital.16 Retail banks in turn have a comparative advantage over households. Finally, the convex cost implies that it is increasingly costly at the margin for retail banks and households to absorb capital directly. As we will see, this cost formulation provides a simple way to limit agents with wealth but lack of expertise from purchasing assets during a ﬁresale. In our decentralization of the economy, a representative household provides cap- ital management services both for itself and for retail banks. For the latter, the household charges retail banks a competitive price fr t per unit of capital managed, where fr", "[10] Though our modeling of runs as products of liquidity mismatch in bank portfolios is in the spirit of Diamond and Dybvig, our technical approach follows more closely Cole and Kehoe’s (2000) model of self-fulﬁlling debt crises. As with Cole and Kehoe, runs re(cid:31)ect a panic failure to roll over short term loans (as opposed to early withdrawal) and whether these kinds of run equilibria exist depends on macroeconomic fundamentals.1 Some other recent examples of macroeconomic models that consider bank runs include Ennis and Keister (2003), Martin, Skeie, and Von Thadden (2014) and Angeloni and Faia (2013).2 These papers typically incorporate banks with short horizons (e.g. two or 1Our framework thus falls within a general class of macroeconomic models that feature sunspot equilbria to charac- terize business cycles. See for example Farmer (1999). 2See Boissay, Collard, and Smets (2013) for an alternative way to model banking crises that does not involve runs three periods)3. We differ by modeling banks that optimize over an inﬁnite horizon. In addition, bank asset liquidation prices are endogenous and affect whether a sunspot bank run equilibrium exists. Section I presents the model and characterizes the equilibria without and with bank runs. For pedagogical purposes, we start with a baseline where bank runs are unan- ticipated. Section II presents a number of numerical experiments to illustrate how the model can capture both standard ﬁnancial accelerator effects and bank runs, as well as the interaction between the two. In Section III, we describe the extension to the case of anticipated bank runs. Here we present some numerical exercises to illustrate how the mere anticipation of runs can lead to harmful effects on the economy, even if the run does not actually occur. In addition, we show how if we allow for a period of an- ticipation prior to an actual run, the model can produce something like the \"slow run culminating in a fast run\" phenomenon described by Bernanke. We discuss policies that can reduce the likelihood of bank runs in Section IV and directions for further research in the conclusion. The framework is a variation of the inﬁnite horizon macroeconomic model with a banking sector and liquidity risks developed in Gertler and Karadi (2011) and Gertler and Kiyotaki (2011).4 There are two classes of agents - households and bankers - with a continuum of measure unity of each type. Bankers are specialists in making loans and thus intermediate funds between households and productive assets. Households may also make these loans directly, but are less efﬁcient in doing so than banks.", "[11] Our work is related to the work by Blickle et al. (2024). They provide empirical evidence based on data from the Great Depression in Germany in 1931 that regular depositors withdraw deposits from all types of banks, whereas “the interbank market collapses for failing banks entirely but continues to function for surviving banks”. Similarly, P´erignon et al. (2018) find in an empirical study2 that “dry-ups predict, but do not cause, future deterioration in bank performance”. In particular, they show that mostly low-quality banks suffer from a funding-dry up and argue that this is in contrast to the idea that these dry-ups are random events. These findings highlight the importance of having a modelling framework for funding withdrawal in the interbank market that is flexible enough that it can include this type of behaviour as well. We develop a pecking order model for funding withdrawals that can achieve this. We consider a financial market consisting of N ∈ N banks with indices in N = {1,...,N}. These banks provide liquidity to each other in the form of interbank lending which gives rise to a network of interbank liabilities that is characterised by the matrix L ∈ [0,∞)N×N. Particularly, Lij is the interbank liability of node i to node j (in GBP), which corresponds to the amount that node i has borrowed from j. 3 Then, the total network liabilities of bank i ∈ N are given by ¯L(network) j=1 Lij, and its total network assets are given by ¯A(network) i We assume that each bank i ∈ N holds liquid external assets, such as cash, denoted by 2P´erignon et al. (2018) consider data on the market for certificates of deposits (CDs) which represent a large segment of the European wholesale funding market. They consider the time period from 2008-2014. 3One could add a fictitious source node labelled as N+1 to the model, which represents external borrowing that has equal priority as interbank borrowing. I.e., L(N+1)j is the amount that bank j has lend to an external market participant that does not otherwise interact with the banks, in particular Li(N+1) = 0 for all i ∈ {1,...,N,N+1}. Since the mathematics does not change, we do not consider this extension any further. A(e),liquid (in GBP).4 Additionally, it holds shares of an illiquid external asset and we denote the number of shares of the illiquid asset that it holds by A(e),illiquid . We assume that the initial price of the illiquid asset is qmax = 1 (in GBP) and hence the value of the illiquid external assets at time 0 is A(e),illiquidqmax = A(e),illiquid (in GBP). We define bank i’s liquid assets by Aliquid liquid external assets and the interbank assets.", "[12] Figure 1 illustrates how we consider the diﬀerent roles of retail and wholesale ﬁnancial intermediaries, following the tradition of Gurley and Shaw (1960).6 The arrows indicate the direction that credit is ﬂowing. Funds can ﬂow from households (ultimate lenders) to non-ﬁnancial borrowers (ultimate borrowers) through three diﬀerent paths: they can be lent directly from households to borrowers (cid:0)Kh(cid:1); they can be intermediated by retail banks that raise deposits (D) from households and use them to make loans to non-ﬁnancial borrowers (Kr); alternatively, lenders’ deposits can be further intermediated by specialized ﬁnancial institutions that raise funds from retail banks in wholesale funding markets (B) and, in turn, make loans to ultimate borrowers (Kw). In what follows we refer to these specialized ﬁnancial institutions as wholesale banks. We think of wholesale banks as highly leveraged shadow banks that rely heavily on credit from other ﬁnancial institutions, particularly short term credit. We place in this category institutions that ﬁnanced long term assets, such as mortgaged back securities, with short term money market instruments, including commercial paper and repurchase agreements. Examples of these kinds of ﬁnancial institutions are investment banks, hedge funds and conduits. We focus attention on institutions that relied heavily on short term funding in wholesale markets to ﬁnance longer term assets because it was primarily these kinds of entities that experienced ﬁnancial turmoil. Our retail banking sector, in turn, includes ﬁnancial institutions that rely mainly on household saving for external funding and provide a signiﬁcant amount of short 6Gurley and Shaw (1960) consider that there are two ways to transfer funds from ultimate lenders (with surplus funds) to ultimate borrowers (who need external funds to ﬁnance expenditure): direct and indirect ﬁnance. In direct ﬁnance, ultimate borrowers sell their securities directly to ultimate lenders to raise funds. In indirect ﬁnance, ﬁnancial intermediaries sell their own securities to raise funds from ultimate lenders in order to buy securities from ultimate borrowers. By doing so, ﬁnancial intermediaries transform relatively risky, illiquid and long maturity securities of ultimate borrowers into relatively safe, liquid and short maturity securities of intermediaries. Here we divide ﬁnancial intermediaries into wholesale and retail ﬁnancial intermediaries, while both involve asset transformation of risk, liquidity and maturity. We refer to intermediaries as ”banks” and to ultimate lenders as ”households” for short.", "[13] In Figure 6 we repeat the experiment, but this time we allow for a run to occur in period 4. The purpose is to illustrate how the model can capture the pattern of a period of slow runs leading to a fast run that was a central feature of the recent ﬁnancial crisis, as we discussed in the Introduction. Relative to the case of Figure 4 where the ex post run is completely unanticipated, there is an enhanced deterioration of ﬁnancial conditions before the run. The rise in pt following the shocks elevates spreads and enhances the out(cid:31)ow bank assets prior to the run, as in the ﬁrst few periods of the experiment in Figure 5. The ex post run still produces a sharp rise in spreads and contraction in bank intermediation. But the signs of stress leading up to the collapse are clearer than in the case of unanticipated runs, in way that is consistent with the data. In particular, in Figure 7 we show that the simple experiment of Figure 6 can capture some of the key features of ﬁnancial stress leading up to and through the Lehmann col- lapse. The top panel plots a representative credit spread, speciﬁcally the excess bond premium by Gilchrist and Zakresjek (2012) over the period 2007Q2 to 2010Q2 versus the value implied by the model experiment, while the bottom panel does the same for the market value of bank equity, measure by the S&P ﬁnancial index.19 This measure of bank equity corresponds to the franchise value Vt in our model We do not try to capture the entire run-up to the Lehmann collapse. Instead, the model economy starts in 2007Q4 and the ﬁrst shock hits in 2008Q1, the time of the Bear Stearns fallout. The ex post run then occurs in 2008Q4, the time of the Lehmann collapse and the collapse of the shadow banking system along with it. Overall, the model reasonably captures the temporal pat- tern of credit spreads and bank equity over the crisis. Following the peak of the crisis, credit spreads in the data decline faster than in the model, likely re(cid:31)ecting the variety of interventions by the Federal Reserve and Treasury to rescue the banking system that are not present in the model. 19The excess bond premium is a index of corporate bond spreads over comparable maturity government bonds that removes the component of the spread that is due to the borrower default risk. Since in our model, the main source of variation in this spread is due to the ﬁnancing constraint and not conventional default risk, the excess bond premium is the appropriate empirical counterpart.", "[14] Specifically, Figure 4 shows the system-wide measures of stress defined in Definition 4.2. The source of the current liabilities are shown using a stacked bar chart with different shades of pink, i.e., the relative initial bank run (IBR) shock SIBR (light pink), the relative late bank run (LBR) shock SLBR (dark pink), and the relative network withdrawal (NW) shock SNW (medium pink). Furthermore, the severity of the stress is specified in terms of the relative current lia- bilities Pcurrent liabilities (black circle), the relative network freeze Pnetwork freeze (green triangle), the relative fire sale share number Pfire sale shares number (blue diamond), the relative liquidity shortfall Pliquidity shortfall (magenta square), the relative banks under late run Punder late bank run (blue star). Figures 4(a), 4(d), 4(d) show the results for proportional withdrawals Θ = ΘProportional, Figures 4(b), 4(e), 4(e) for withdrawals according to the pecking order in which the largest interbank assets are withdrawn first Θ = ΘLargest, Figures 4(c), 4(f), 4(f) for withdrawals according to the pecking order in which the smallest interbank assets are withdrawn first Θ = ΘSmallest. We find that when comparing the different rows (different price impact parameters α), the overall outcome worsens as expected. In particular, in line with our modelling framework, higher price impact parameters increase the risk of late bank runs which is clearly visible in rows 2 and 3 that show additional dark pink bars in the stacked bar chart. The pecking order tends to influence the outcome of the system more strongly for smaller price impact parameters, i.e., here α ∈ {0,0.01}, because then there is a greater chance that banks do not need to withdraw all their interbank assets and hence the order in which they withdraw matters. But even for a large price impact (α = 0.04), we see that for example, in Scenario 1, i.e., a bank run on Bank 1, the magnitude of the network freeze is still not the same across the three different pecking order considered. Figure 5 shows the traffic light measures defined in Definition 4.1 and additionally the price of the illiquid asset q∗ obtained by computing the greatest fixed point.", "[15] t  Rt and t are all endogenous variables, the possibility of a bank run may vary with macroeconomic conditions. The equilibrium absent bank runs (that we de- scribed earlier) determines the behavior of Rt and t The behavior of Rb is increasing t in the liquidation price Qt  which also depends on the behavior of the economy, as we show in the next sub-section. Figure 2 illustrates how the possibility of a run may depend on macroeconomic con- ditions. The vertical axis measures the ratio of bank asset returns conditional on a run to the deposit rate, Rb 1 The  curve which is increasing and concave in Rb 1 space represents combinations  of points for which the recovery rate xt equals unity. To the left of this curve, depositors always receive the promised returns on their deposits and a bank run equilibrium does not exist. To the right, xt  1 and a bank run is possible. In the simulations that follow we start the economy at a point like A in the ﬁgure where a run is not feasible. A negative shock then raises leverage and reduces liquidation prices (as we show below), moving the economy to a point like B where a bank run is possible. t Rt and the horizontal axis measures the leverage multiple t t Rt, t To determine Qt we proceed as follows. A depositor run at t induces all banks that 1 to fully liquidate their asset positions and go out of business.14 carried assets from t Accordingly they sell all their assets to households, who hold them at t The banking system then re-builds itself over time as new banks enter. For the asset ﬁresale during the panic run to be quantitatively signiﬁcant, we need there is at least a modest delay in the ability of new banks to begin operating. Accordingly, we suppose that new banks cannot begin operating until the period after the panic run. Suppose for example that during the run it is not possible for households to identify new banks that are ﬁnancially independent of the banks being run on: New banks accordingly wait for the dust to settle and then begin issuing deposits in the subsequent period. The results are robust to alternative timing assumptions about the entry of new banks, with the proviso that every thing else equal, the severity of the crisis is increasing in the time it takes for new banks to begin operating."], "final_answer": "In the finance–biology analogy posed in the question, a “cell membrane” corresponds to the liquidity shield that every bank keeps between itself and the outside world, while a systemic “bank run” plays the role of an external stressor that tries to perforate that membrane.  The model summarised in the supplied text lets us see, at two complementary levels, how the system reacts when that protective layer is shaken.\n\n1.  Structural (meso-level) mechanisms – the “architecture of the membrane”\n\n•  Network topology of inter-bank claims Each bank’s exposure matrix Lij defines where liquidity can leak once one institution is pierced.  Because L is directed, stress propagates from creditors to borrowers, the opposite of the more familiar borrower-to-lender loss transmission [3, 11].  \n•  Liquidity buffers and the Basel III LCR Liquid assets are the membrane’s first line of defence; if they are big enough (as intended by the Liquidity Coverage Ratio) the shock is absorbed locally, preventing a tear [2].  Empirically, weaker institutions such as SVB were outside the LCR perimeter and therefore kept thinner “membranes” [2].  \n•  Leverage thresholds κi Regulatory or market-imposed leverage caps act like membrane-stiffening proteins: only when the ratio is high enough can a run equilibrium exist [6].  Raising κ (tightening the cap) makes the membrane easier to rupture and therefore triggers runs earlier, exactly as shown when κ rises from 0.03 to 0.06 in the calibration exercise of Figure 8 [4].  \n•  Pecking-order withdrawal rules The order in which funding is yanked (largest line first, smallest line first, or proportionally) determines which parts of the membrane split first and how wide the tear becomes; the model shows materially different systemic outcomes for the three rules even under the same macro shock [14].\n\n2.  Molecular (micro-level) mechanisms – the “chemistry at the tear”\n\n•  Sequential use of liquidity A bank first spends liquid assets; if these are exhausted it “pulls” its inter-bank assets, creating a microscopic hole that immediately puts pressure on neighbours’ buffers [8].  \n•  Price-mediated fire-sale feedback If neighbours cannot plug that hole they liquidate illiquid assets; the price impact parameter α translates every extra unit sold into a drop in the common asset price, deepening the cut in all balance sheets simultaneously [8, 14].  \n•  Endogenous late runs Once the price fall has pushed leverage back above the critical threshold, previously untouched institutions experience a secondary (“late”) run—the model’s dark-pink LBR component—which represents a fresh molecular assault on still-intact membrane patches [14].  \n•  Liquidity shortfall and insolvency If the combined shock exceeds total buffers the relative liquidity shortfall PLiquidity shortfall rises and nodes migrate from “red” (run but alive) to “purple” (bankrupt) states, i.e. complete membrane rupture and cell death [4, 14].\n\n3.  System-wide biomarkers – reading the damage\n\nThe model supplies quantitative “stress biomarkers” analogous to cellular damage indicators: Pcurrent liabilities, Pnetwork freeze, Pfire-sale shares, PLiquidity shortfall and Punder late run [7, 14].  These translate microscopic tears into a macroscopic diagnosis and allow regulators to design thicker membranes (bigger buffers, tighter leverage caps) or faster clotting agents (lender-of-last-resort facilities).\n\nIn short, the stress-induced destabilisation of a bank’s “membrane” triggers a cascade that starts with local buffer use, spreads through funding withdrawals, and is amplified by price-mediated fire sales.  Structural parameters (network topology, buffer size, leverage ceilings) decide where the membrane cracks, while molecular feedback loops (withdrawal rules, price impact) decide how wide the fissure becomes and whether neighbouring cells are pulled into the same neuro-degenerative-like death spiral.  The framework therefore offers a unified, mechanistic view of how apparently local liquidity shocks can evolve into full-blown systemic crises [8, 14, 6, 2].", "citations": {"3": "not found", "4": "not found", "11": "not found", "8": "not found", "7": "not found", "14": "not found", "6": "10.17016/IFDP.2016.1156", "2": "not found"}}
