{"timestamp": "2025-10-07T09:48:49.072877", "input_query": "Explain the topic of post translational modification of h2bk120", "rewritten_query": "Please provide a detailed explanation of the post-translational modifications of histone H2BK120, including the specific types of modifications (e.g., ubiquitination, acetylation, methylation, etc.), the enzymes involved in these processes, the functional consequences for chromatin structure and gene regulation, the experimental methods used to identify and characterize these modifications, relevant studies or datasets that focus on H2BK120 modifications, the biological contexts or cell types where these modifications have been observed, and any timeframes or developmental stages associated with changes in H2BK120 post-translational modifications.", "retrieved_chunks": ["[1] Histone modifications such as acetylation, methylation, phosphorylation, and ubiquitination regulate chromatin structure and interactions. Histone H2B monoubiquitination (H2B-Ub) at K123 in yeast, K120 in humans, is a transient modification that is a universal feature of genes that are actively transcribed by RNA polymerase II (1). H2B-Ub plays a nondegradative role in transcription activation, elongation, mRNA splicing, and mRNA export, as well as in DNA replication and damage repair (2). Histone H2B is monoubiquitinated by Rad6/Bre1 (3), which is required for H3K4 and H3K79 trimethylation (4, 5). H2B-Ub also enhances recruitment of FACT (facilitates chromatin transcription) (6), a histone chaperone that mediates H2A/H2B dimer eviction and nucleosome reassembly (7). H2B is deubiquitinated by the Spt-Ada-Gcn5 acetyltransferase (SAGA) coactivator complex (8). The minimal SAGA subcomplex with deubiquitinating (DUB) activity is called the Corresponding author. cwolberg@jhmi.edu. SUPPLEMENTARY MATERIALS www.sciencemag.org/content/351/6274/725/suppl/DC1 Materials and Methods Figs. S1 to S12 Table S1 References (33–48) M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t SAGA DUB module, which in yeast contains the catalytic subunit Ubp8 as well as Sgf11, Sus1, and the Sgf73 N-terminal ~100 residues (8–10). The DUB module is an independently folding subcomplex that is connected to the remainder of the SAGA complex by the C- terminal portion of Sgf73 (11). The basic features of the yeast DUB module are conserved in human SAGA (12). The structure of the yeast DUB module in the presence and absence of bound ubiquitin (9, 10) revealed a highly intertwined arrangement for the four subunits, with Sgf11, Sgf73, and Sus1 serving in part as scaffolds that help to maintain the Ubp8 catalytic domain in an active conformation (13, 14).", "[2] Monoubiquitination of histones H2B-K120 (H2BK120ub) and H2A-K119 (H2AK119ub) play opposing roles in tran- scription regulation and chromatin compaction ( 16 ,17 ). H2BK120ub is enriched in actively transcribed genes ( 18 ,19 ), where it stimulates methylation of histone H3-K4 ( 18 , 20 , 21 ) and H3-K79 ( 19 , 22 , 23 ). H2BK120ub is dynamically regu- lated throughout the cell cycle ( 24 ), serving as a signal for the DNA damage response ( 25 ) and chromatin decompaction ( 8 ). H2AK119ub is enriched at heterochromatic regions ( 26 ), where it stimulates trimethylation of H3K27 ( 27–29 ), a re- pressive mark ( 30 ), and promotes chromatin compaction ( 31 ,32 ). There have been several reports that H2BK120ub can in- terfere with the binding of proteins to nucleosomes, includ- ing human RCC1, yeast Sir3, and Kaposi’s sarcoma-associated herpesvirus latency-associated nuclear antigen (LANA) pep- tide ( 33–35 ). All three proteins contact the nucleosome acidic patch, which raises the possibility that the ubiquitin conju- gated to H2BK120 interferes with their binding to this sur- face ( 13 , 14 , 36 ). However, a role for H2BK120ub in block- ing protein binding seems at odds with the presumed mobility of ubiquitin, given the flexibility of its carboxy-terminal tail and of the aliphatic lysine side-chain to which it is covalently linked ( 37 ). Such flexibility could, in principle, allow ubiquitin to adopt positions on the nucleosome surface that would not clash with protein binding. To gain insight to the structural basis by which H2BK120ub could interfere with protein binding to the nucleosome, we de- termined cryoEM structures of nucleosomes containing ubiq- uitin conjugated to H2B-K120. We found that the ubiquitin adopts several distinct positions that partially occlude the nu- cleosome acidic patch. Molecular dynamics (MD) simulations indicate that the ubiquitin conjugated to H2B-K120 remains stably associated over the nucleosome acidic patch, in posi- tions that would be expected to interfere with protein bind- ing. We also determined cryoEM structures of H2AK119ub nucleosomes and found that, while the ubiquitin adopts two distinct positions, neither significantly occludes the acidic patch. In vitro studies showed that H2BK120ub, but not H2AK119ub, dramatically reduces nucleosome binding by RCC1, LANA peptide, and single domain antibodies that specifically contact the acidic patch. Our results establish a mechanism by which H2BK120ub can regulate protein bind- ing to the nucleosome acidic patch, thereby impacting a major hub of chromatin interactions.", "[3] Crosstalk between histone ubiquitination and methylation plays well-characterized roles in both gene activation and repression. Monoubiquitinated histone H2AK119 (H2AK119ub) is highly enriched in transcriptionally silent regions of chromatin [2], while monoubiquitinated histone H2BK120 (H2BK120ub) is found in actively transcribed regions [3]. H2AK119ub stimulates methylation of histone H3K27, a repressive mark, while H2BK120ub (in humans; K123 in yeast) stimulates methylation of histone H3K4 and H3K79, two modifications that are hallmarks of actively transcribed chromatin. Up to three methyl groups can be conjugated to the Nζ of lysine, with mono-, di-, and tri-methylated lysine (me1, me2, me3) in some cases playing distinct roles [4]. The first structural studies to shed light on the mechanism of cross-talk revealed how H2BK120/123ub stimulated methylation of histone H3K4 by yeast COMPASS and of H3K79 by human DOT1L [5]. More recent work has provided the first insights into the mechanism by which H2AK119ub stimulates Polycomb Repressive Complex 2 (PRC2) to methylate H3K27 [6]. Here, we discuss how new structural studies of the human H3K4 methyltransferase, MLL1, as well of yeast and human H3K79 methyltransferases, Dot1 and DOT1L, have provided important new insights into the multiple roles H2BK120ub plays in the cascade of activating histone marks [7]. Tri-methylation of histone H3K27 is responsible for transcriptional repression and chromatin compaction of Polycomb target genes [8], which play essential roles in cell differentiation and development [9]. First identified in Drosophila mutants displaying homeotic transformations, the Polycomb Group (PcG) genes were found to encode two multisubunit enzymes, Polycomb repressive complexes 1 (PRC1) and 2 (PRC2) [9]. These complexes regulate multiple genes required for lineage commitment during embryonic development and for maintaining cell identity in all metazoans [10]. PRC1 is a heterodimeric E3 ligase that monoubiquitinates histone H2AK119 via its Ring1B and Bmi1 subunits and is a therapeutic target due to its involvement in cancer [11,12]. H2AK119ub, in turn, is required for trimethylation of H3K27me3 by PRC2 [13], a multiprotein complex containing Set-family methyltransferase, EZH1 or EZH2 [14]. The PRC2 core complex comprises four core proteins: EZH1/2, EED, SUZ12, and RBAP46/48 [15]. Whereas the PRC2-core complex is a weak enzyme on its own, inclusion of the AEBP2 and JARID2 subunits in the complex increases PRC2 methyltransferase activity nearly five-fold [16,17]. While H2AK119ub was known to be essential for PRC2 mediated transcriptional repression by promoting H3K27 methylation [13,18], the direct molecular mechanism underlying the cross-talk between these two histone modifications was not, until recently, fully understood.", "[4] M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t HHS Public Access Author manuscript Nat Struct Mol Biol. Author manuscript; available in PMC 2025 January 28. Published in final edited form as: Monoubiquitination of histone H2BK120/123 plays multiple roles in regulating transcription, DNA replication and the DNA damage response. The structure of a nucleosome in complex with the dimeric RING E3 ligase, Bre1, reveals that one RING domain binds to the nucleosome acidic patch, where it can position the Rad6 E2, while the other RING domain contacts the DNA. Comparisons with H2A-specific E3 ligases suggests a general mechanism of tuning histone specificity via the non-E2-binding RING domain. Post-translational modification (PTM) of histones plays a central role in regulating eukaryotic transcription. Monoubiquitination of histone H2B-K123 in yeast, K120 in humans (H2B-Ub), is a hallmark of actively transcribed genes that also plays a role in DNA replication, DNA repair and RNA processing1–3. H2B-Ub stimulates methylation of histone H3-K4 and K79, and recruits FACT (Facilitates Chromatin Transcription) to promote efficient transcriptional elongation4,5. Bre1 is a dimeric ubiquitin E3 ligase that targets the E2 ubiquitin conjugating enzyme, Rad6, to monoubiquitinate H2B-K123 in yeast6,7. In humans, the closely related RNF20/RNF40 heterodimer targets RAD6A/B to ubiquitinate histone H2B-K1208,9. Mutations and deletions of RNF20/40 are found in a variety of cancers and are indicators of poor prognoses10. The mechanism underlying the specificity of H2B-K123/120 ubiquitination is unknown. We report here the cryo-EM structure of a Bre1 E3 ligase dimer bound to a nucleosome that reveals the molecular basis for specific ubiquitination of histone H2B. The fragment used in the study, Bre1 591–700, includes the RING domain and a coiled-coil that mediates dimerization11, and directs specific ubiquitination of H2B-K12312. Three distinct states of the Bre1-nucleosome complex were resolved at overall resolutions of 3.47 Å for state 1, 3.25 Å for state 2, and 3.21 Å for state 3 (Extended Data Figs.1,2 and Table 1). In each", "[5] Introduction Eukaryotic chromatin is decorated with a wide range of reversible histone post-translational modifi- cations (PTMs) that regulate all processes that require access to DNA, including transcription, DNA replication and DNA repair (Bannister and Kouzarides, 2011; Bowman and Poirier, 2015). Actively transcribed genes in all eukaryotes are enriched in monoubiquitinated histone H2B, which plays a non-degradative role in promoting transcription (Fleming et al., 2008; Weake and Workman, 2008) but whose mechanism of action remains poorly understood. Monoubiquitin is conjugated to H2B-K123 in yeast and H2B-K120 in humans, which lie near the C-terminus of histone H2B (Robzyk et al., 2000; Weake and Workman, 2008; West and Bonner, 1980). Monoubiquitination of histone H2B is highly dynamic (Henry et al., 2003), and the cycle of ubiquitination and subse- quent deubiquitination is an important checkpoint for transcription elongation (Batta et al., 2011). H2B-K123 ubiquitination is required for methylation of histone H3K4 (Chandrasekharan et al., 2010; Dover et al., 2002) and H3K79 (Ng et al., 2002), two other marks correlated with actively transcribed genes. However, H2B-Ub also plays a role in promoting transcription that is independent of cross-talk with histone H3 methylation (Tanny et al., 2007). In addition to its role in transcription, H2B-Ub plays a role in replication fork progression, nucleosome assembly during DNA replication (Ng et al., 2002) and the DNA damage response (Giannattasio et al., 2005; Moyal et al., 2011; Uckelmann and Sixma, 2017). Dysregulation of histone H2B monoubiquitination has been linked to a variety of cancers (Cole et al., 2015; Espinosa, 2008; Hahn et al., 2012). In the yeast, Saccharomyces cerevisiae, histone H2B-K123 is monoubiquitinated by the E2/E3 pair, Rad6/Bre1 (Hwang et al., 2003; Robzyk et al., 2000; Wood et al., 2003), and deubiquitinated by two deubiquitinating enzymes (DUBs): Ubp8 and Ubp10 (Daniel et al., 2004; Gardner et al., 2005; Henry et al., 2003). Both of these DUBs belong to the Ubiquitin Specific Protease (USP) class of cysteine proteases, which contain a characteristic USP catalytic domain (Komander et al., 2009). Ubp10 is a monomeric enzyme whereas Ubp8 is part of a four-protein subcomplex within the SAGA complex called the DUB module, which comprises Ubp8, Sgf11, Sus1, and Sgf73 (Henry et al., 2003; Ko¨hler et al., 2010; Samara et al., 2010). Both yeast H2B-Ub DUBs are conserved in humans. USP36, the human homologue of Ubp10, can complement the effects of a ubp10 deletion on global H2B-Ub in yeast (Reed et al., 2015) and USP22, the homologue of Ubp8, is a subunit of human SAGA (Zhang et al., 2008). Yeast in which both Ubp10 and Ubp8 have been deleted showed a syn- ergistic increase in the steady-state levels of global H2B-Ub, as well as growth defects (Emre et al., 2005). While the roles of Ubp10 and Ubp8 in regulating H2B deubiquitination are well-established, their respective contributions to chromatin-mediated processes are poorly understood.", "[6] Whereas most histone modifications consist of small chemical groups, histones can also be modified by the covalent attachment of the 76-amino acid protein, ubiquitin, to the ε-amino group of lysine [5,6]. Histone ubiquitination serves a signaling, rather than a degradative role, and its relatively large size and complexity distinguishes it from small side chain modifications such as acetylation, methylation, or phosphorylation. Ubiquitin is attached to specific lysine residues by a cascade of E1/E2/E3 conjugation machinery, with the E2/E3 pair conferring substrate specificity [7]. Ubiquitination of histone H2B, Lys120 (H2BK120ub) is enriched at actively transcribed genomic loci [8], whereas ubiquitin attached to histone H2A, Lys 119 (H2AK119ub) is a mark found in heterochromatic regions [9]. In response to DNA double strand breaks (DSBs), histone H2A is also ubiquitinated at K13/K15 (forming H2AK13ub or H2AK15ub, respectively), where this mark is required for recruiting the DSB repair machinery [10]. Histones H1, H3 and H4 have also been shown to be ubiquitinated in response to UV irradiation [11,12]. In many cases, there is “cross-talk” between histone ubiquitination and other types of histone modifications, with the ubiquitin mark either recognized in conjunction with specific marks such as methyl-lysine, or examples where histone ubiquitination is a prerequisite for deposition of other histone modifications such as methylation or acetylation [13–15]. Until recently, our structural understanding of how histone ubiquitination marks are attached, recognized and removed has been restricted to studies of the readers, writers and erasers in the absence of their chromatin targets. This changed with the 2014 report of the structure of the PRC1 E3/E2 enzyme pair bound to a nucleosome [16], which provided the first view of how a “writer” complex specifically targets histone residue H2AK119 in a chromatin context [17]. In this review, we describe recent advances that have shed light on how a “reader” recognizes ubiquitinated histones in conjunction with methyl marks, how an “eraser” complex specifically removes ubiquitin from histone H2B, as well as how the large, multifunctional chromatin-binding enzymatic complexes coordinate the structural dynamics of multiple subcomplexes to modify nucleosomes.", "[7] Histone ubiquitination serves a non-degradative role in regulating transcription (Henry et al., 2003; Turner et al., 2002; Zhang, 2003), DNA repair (Moyal et al., 2011), DNA replication (Hung et al., 2017; Somasagara et al., 2017), and chromatin condensation (Fierz et al., 2011). Monoubiquitination of histone H2B (H2B-Ub) at lysine 120 in humans and lysine 123 (Robzyk et al., 2000) in yeast is a hallmark of actively transcribed genes (Weake and Workman, 2008). H2B-Ub plays a variety of roles in transcription, including promoting assembly of the pre-initiation complex (PIC) (Kao et al., 2004; Turner et al., 2002) and stimulating nucleosome reassembly by the histone chaperone, FACT (Fleming et al., 2008; Pavri et al., 2006). H2B-Ub also stimulates H3K4 methylation by human MLL1 and yeast COMPASS (Dover et al., 2002; Kim et al., 2009; Sun and Allis, 2002; Xue et al., 2019), and H3K79 methylation by human Dot1L and yeast Dot1 (Briggs et al., 2002; McGinty et al., 2008; Ng et al., 2002a; Ng et al., 2002b; Steger et al., 2008). H2B-Ub is distributed throughout gene bodies and is particularly enriched at transcription start sites (TSSs), Cell Chem Biol. Author manuscript; available in PMC 2023 April 21. M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t (Kao et al., 2004; Schulze et al., 2011). An intriguing aspect of H2B-Ub is that it is a transient mark that is rapidly turned over during transcription, with both ubiquitination and deubiquitination of H2B important for maintaining wild type levels of transcription (Batta et al., 2011; Henry et al., 2003; Kao et al., 2004). Deubiquitination of histone H2B plays a role in promoting phosphorylation of the RNA polymerase II CTD by Ctk1, thereby promoting the elongation phase of transcription (Wyce et al., 2007). Studies have shown that genes with low H2B-Ub levels are expressed at higher levels than those with high H2B-Ub (Hahn et al., 2012; Prenzel et al., 2011; Shema et al., 2008). Consistent with findings in yeast, surveys of gene expression in primary human cancer cells found that loss of USP22 resulted in changes in transcription at SAGA regulated genes (Atanassov et al., 2016).", "[8] How might the ability of H2BK120ub to control access to the nucleosome acidic patch help orchestrate the complex se- ries of events that take place during transcription initiation and elongation? Histone H2BK120 is dynamically ubiquiti- nated and deubiquitinated during transcription ( 97 ), which enables the conjugated ubiquitin to serve a transient gating function that can be switched off by removal of the ubiqui- tin ( 98 ). While the precise point at which ubiquitin is con- jugated and subsequently removed is not known, the tran- sient presence of H2BK120ub can delimit the period dur- ing which certain acidic patch binders cannot be recruited to the nucleosome. Most chromatin remodeling enzymes must bind to the nucleosome acidic patch to reposition nucleosomes and activate transcription ( 99 ), and can therefore potentially be regulated by ubiquitination of H2B. An example is yeast SWR1C, which exchanges the canonical H2A for histone vari- ant, H2A.Z, and contacts the nucleosome acidic patch, as well as the C-terminus of histone H2B ( 100 ). Intriguingly, ubiq- uitination of H2B and incorporation of the histone variant, H2A.Z, at the +1 nucleosome are anticorrelated ( 101 ), con- sistent with a model in which ubiquitin disrupts SWR1C ac- tivity ( 100 ). The remodeling enzyme, Chd1, is stimulated by H2BK120ub, although the stimulation mechanism may be re- lated to a role for ubiquitin in favoring the unwrapping of nucleosomal DNA in the presence of Chd1 ( 81 ). Further stud- ies will be needed to address the mechanisms underlying the complex roles that H2B ubiquitination plays in transcription, DNA replication, and DNA repair. Monoubiquitination of histones H2A and H2B play op- posing roles in regulating transcription through their interac- tion with enzymes that specifically recognize these modifica- tions, and by promoting or disrupting chromatin compaction ( 16 ,17 ). Our studies shed light on a potential additional mech- anism in which H2BK120ub, but not H2AK119ub, regulates binding to the acidic patch, a hub of nucleosome engagement for diverse chromatin interactors.", "[9] The packaging of eukaryotic DNA into chromatin governs all cellular processes requiring access to DNA, such as transcription [1], DNA replication [2], and DNA repair [3]. The minimal organizational unit of chromatin is the nucleosome, which comprises 147 base pairs of DNA wrapped around an octameric core of histone proteins H2A, H2B, H3 and H4 [4]. The cell regulates the higher-order organization and position of nucleosomes through post- translational modification of histone proteins. These modifications modulate the packaging of DNA into chromatin and recruit a variety of protein complexes and enzymes [5,6]. Most posttranslational histone marks are small chemical modifications such as phosphorylation, methylation, and acetylation, which alter the steric bulk or charge of the modified histone sidechain. Histones can also be modified with the 76-amino acid protein, ubiquitin [7], a comparatively large modification that regulates a wide array of cellular processes including transcription activation, silencing, DNA repair and chromatin compaction [8,9]. The structural motifs that recognize ubiquitin [10] and ubiquitinated nucleosomes [11] have been reviewed recently. The precise patterning of histone modifications – termed the “histone Corresponding author: cwolberg@jhmi.edu. Conflict of Interest Statement C.W. is a member of the scientific advisory board of Thermo Fisher Scientific. Publisher's Disclaimer: This is a PDF file of an unedited manuscript that has been accepted for publication. As a service to our customers we are providing this early version of the manuscript. The manuscript will undergo copyediting, typesetting, and review of the resulting proof before it is published in its final citable form. Please note that during the production process errors may be discovered which could affect the content, and all legal disclaimers that apply to the journal pertain. M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t code” [6] – is therefore required to properly regulate processes that access DNA. Dysregulation of histone modifications can lead to a variety of human diseases. Some histone marks trigger modification of other histone residues. This interdependence of histone modifications, where recognition or deposition of one mark depends on the presence of another, is called “histone crosstalk” [12]. A well-established example of histone crosstalk is the dependence of histone H3K4 and H3K79 methylation on prior monoubiquitination of histone H2B K120 (H2B-Ub) (in humans; H2B K123 in yeast) [13-16]. H3K79 and H3K4 methylation are catalyzed by two enzymes: disruptor of telomeric silencing-like protein (Dot1L) [17], which methylates H3K79 in humans, and the complex of proteins associated with Set1 (COMPASS), which methylates H3K4 [18]. Dot1L contains a catalytic domain that resembles arginine methyltransferases [19] and the catalytic subunit of COMPASS (Set1) contains a SET lysine methyltransferase domain [20-22], [23]**, [24]**. Dot1L and COMPASS are evolutionarily unrelated enzymes that are conserved from yeast to humans. Recent structures of Dot1L bound to a ubiquitinated nucleosome [25]**, [26]**, [27]**, [28]*, [29]*, Dot1L-binding partners, and COMPASS [23]**, [24]** have provided crucial insights into how Dot1L recognizes and is activated by ubiquitin and how the COMPASS subunits activate Set1", "[10] Genetic information is stored in eukaryotes as a nucleoprotein complex known as chromatin, whose repeating unit is called the nucleosome.[1] Each nucleosome comprises approximately 146 base pairs of DNA wrapped twice around a histone octamer core consisting of two copies each of the four histone proteins, H2A, H2B, H3 and H4. Reversible posttranslational modifications (PTMs) of histones such as methylation, acetylation, phosphorylation and ubiquitination play a central role in regulating all processes requiring access to the genomic DNA in its chromatin context.[2] Mono-ubiquitination of histone H2B, for example, plays important roles in transcription activation, elongation, mRNA splicing and export, as well as in DNA replication and DNA damage repair.[3] H2B ubiquitination at Lys120 (H2BK120Ub) stimulates methylation of Lys79 methylation of H3 by the DOT1 histone methyl transferase[4] and Lys4 methylation of H3 by Set1.[5] Histone H2BK120 (in humans; Lys123 in yeast) is deubiquitinated by the Spt-Ada-Gcn5 acetyltransferase (SAGA) complex, a transcriptional co-activator complex that contains a four protein subcomplex Angew Chem Int Ed Engl. Author manuscript; available in PMC 2017 April 11. M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t (Ubp8/Sgf11/Sus1/Sgf73), known as the deubiquitinating module (DUBm) that cleaves ubiquitin from histone H2B.[6] Several studies have shown that phosphorylation of various H2A residues is involved in regulating a variety of biological processes, such as DNA double-strand break repair.[7] Phosphorylation of Ser121 of H2A, for example, was reported to prevent chromosome instability[8] while phosphorylation of Ser1 inhibits transcription on a chromatin template.[9] Very recently, a new conserved phosphorylation site in human histone H2A at Tyr57 (H2AY57p) was discovered.[10] Phosphorylation of H2AY57 was found to inhibit deubiquitination of H2B by the SAGA complex as well as restricting demethylation of histone marks Lys4 and Lys79 and increasing acetylation of Lys27 in H3.[10] Evidence for the effect of phosphorylated H2AY57 however, was indirect and was investigated in vivo by monitoring the effects of chemical inhibition of Tyr kinase CK2 or by mutating the phosphorylation site.[10] A barrier to obtaining molecular insights into the impact of phosphorylated H2AY57 on deubiquitination by the SAGA DUBm is the difficulty in obtaining H2A homogenously phosphorylated at Tyr57, as well as the absence of any suitable amino acid mimic of phosphotyrosine. Such a study would also require H2B homogenously modified by the covalent attachment of ubiquitin to Lys120 (H2BK120Ub) and the assembly of nucleosomes containing the two desired modifications, which could then be used for further biochemical analysis. To answer this question, among many others, obtaining homogeneous H2AY57p and H2BK120Ub is an essential starting point.", "[11] Abstract Monoubiquitination of histones H2B-K120 (H2BK120ub) and H2A-K119 (H2AK119ub) play opposing roles in regulating transcription and chromatin compaction. H2BK120ub is a hallmark of actively transcribed euchromatin, while H2AK119ub is highly enriched in transcriptionally repressed het- eroc hromatin. Whereas H2BK1 20ub is kno wn to stimulate the binding or activity of v arious chromatin-modifying enzymes, this post-translational modification (PTM) also interferes with the binding of se v eral proteins to the nucleosome H2A / H2B acidic patch via an unknown mechanism. Here, w e report cry oEM str uct ures of an H2BK120ub nucleosome showing that ubiquitin adopts discrete positions that occlude the acidic patch. Molecular dynamics simulations show that ubiquitin remains stably positioned over this nucleosome region. By contrast, our cryoEM str uct ures of H2AK119ub nucleosomes show ubiquitin adopting discrete positions that minimally occlude the acidic patch. Consistent with these observations, H2BK120ub, but not H2AK119ub, abrogates nucleosome interactions with acidic patch-binding proteins RCC1 and LANA, and single-domain antibodies specific to this region. Our results suggest a mechanism by which H2BK120ub serves as a gatekeeper to the acidic patch and point to distinct roles for histone H2AK119 and H2BK120 ubiquitination in regulating protein binding to nucleosomes. The nucleosome is the fundamental organizational unit of chromatin and comprises two copies each of histones H2A, H2B, H3, and H4 wrapped by ∼147 base pairs (bp) of DNA. Nuclear proteins interact with the nucleosome at various sites including the histone core, histone tails, nucleosomal DNA, and extra-nucleosomal linker DNA ( 1 ,2 ). The core histones are subject to a wide array of post-translational modifica- tions (PTMs) that play a central role in regulating transcrip- tion ( 3 ), DNA replication ( 4 ), chromatin compaction ( 5 ), and the DNA damage response ( 6 ). PTMs ranging from small chemical groups, such as methyl, acetyl, and phosphoryl, to the attachment of 76-amino acid ubiquitin ( 7 ), modulate pro- tein binding to chromatin and impact higher-order chromatin structure ( 8 ,9 ), thereby regulating downstream biological pro- cesses ( 10 ,11 ).", "[12] M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t The histone proteins that organize and package DNA into chromatin are subject to a wide array of reversible post-translational modifications. The fundamental building block of chromatin is the nucleosome, which consists of approximately 146 base pairs of DNA wrapped around an octameric histone core comprising two copies each of histones H2A, H2B, H3 and H4. Histone modifications play a key role in most biological processes involving DNA, including DNA repair, replication, transcription and maintenance of the boundaries between actively transcribed euchromatin and transcriptionally silent heterochromatin.[1] It has been hypothesized that regulation of these events is controlled by multiple histone post-translational modifications or ‘marks’, collectively referred to as the histone code.[2] Post-translational modifications (PTMs) are chemical moieties covalently attached to a protein[3] that are used to regulate cellular processes by altering a protein’s structure, function, activity, localization, stability and/or interactions.[4] The core histone proteins are heavily modified, especially on their N- and C-terminal ‘tails’, which extend out from the nucleosome core. Neighboring modifications can work collectively in either a synergistic, antagonistic or sequential manner. This is known as modification ‘cross-talk’.[5] A direct link between aberrations in histone PTM profiles and a number of human cancers and diseases has been established.[6] A goal of epigenetic research is to fully characterize these signatures and understand how they define cell-specific patterns of gene regulation.[7] Once the mechanisms behind diverse patterns of histone modification are better understood, the alterations that occur during cancer or disease can be identified.[8] This knowledge can then be applied to screening, detection, prognosis predictions, treatment and therapeutic monitoring.[7] Mass spectrometry provides a particularly effective way to identify histone marks by monitoring the changes in mass that accompany these modifications. Indeed, there are now numerous reports using both top-down analyses of intact histones[9–11] and bottom-up methods that sequence tryptic fragments.[12] Mass spectrometry has been used to provide a global analysis of histone acetylation,[13] to distinguish isomeric forms[12] and to identify new marks.[14] The analysis of lysine modifications using trypsin-based bottom-up methods is complicated by the fact that trypsin cleaves C-terminally to lysine residues unless they are modified, leaving peptides of varying lengths and chemical characteristics so that the modified and unmodified forms of the protein cannot be directly compared in the mass spectrometer. However, the chemical derivatization of unmodified lysine residues by deuteroacetylation[15] or propionylation[16] can be used to overcome this limitation for effective qualitative and quantitative characterization of lysine PTMs using bottom-up analysis of the tryptic peptides resulting from subsequent enzymatic cleavage at arginine residues.", "[13] Competing Interests C.W. is a member of the scientific advisory board of ThermoFisher Scientific. M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t Cryo-EM structures show how H2B monoubiquitination anchors the Dot1L methyltransferase to nucleosomes and stimulates methylation of histone H3K79. H2B-ubiquitin anchors Dot1L at one edge of the nucleosome, allowing the enzyme to adopt a poised or active state. In the active complex, the histone H4 tail binds to a pocket in Dot1L and positions the active site over H3K79. Dot1L and the H4 tail together induce a conformational change in the globular core of histone H3 that inserts K79 into the Dot1L active site. Post-translational modifications of histones play a central role in regulating all cellular processes requiring access to DNA. Cross-talk between histone modifications, in which one histone modification regulates deposition of a second (Suganuma and Workman, 2008), provides an additional layer of regulation and specificity. The dependence of histone H3 Lysine79 (H3K79) methylation on monoubiquitination of histone H2B Lysine120 (humans; lysine 123 in yeast) (Briggs et al., 2002; McGinty et al., 2008; Ng et al., 2002b; Steger et al., 2008; Van Leeuwen et al., 2002) is an example of cross-talk that is conserved across eukaryotes. H3K79 mono-, di- and tri-methylation regulates transcription elongation M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t (Kouskouti and Talianidis, 2005; Krogan et al., 2003; Steger et al., 2008), telomeric silencing (Ng et al., 2002a; Takahashi et al., 2011) and the DNA damage response (Giannattasio et al., 2005; Huyen et al., 2004; Wysocki et al., 2005). H3K79 is methylated by human Dot1L (Feng et al., 2002; McGinty et al., 2008) and yeast Dot1 (Van Leeuwen et al., 2002), which are methyltransferase enzymes that attach up to three methyl groups to the lysine ε amino group using S-adenosylmethionine (SAM) as the methyl donor (Feng et al., 2002; Van Leeuwen et al., 2002). Human Dot1L is a 1,527 amino acid protein that contains an N-terminal methyltransferase domain that is conserved in yeast Dot1p (Sawada et al., 2004), and a C-terminal extension that interacts with proteins that direct Dot1L to specific genomic loci (Kuntimaddi et al., 2014). Mislocalization of Dot1L due to gene fusions between Dot1L-interacting proteins and the histone H4 methyltransferase, Mixed Lineage Leukemia (MLL) can lead to hypermethylation of H3K79 and constitutive gene expression at ectopic loci, which is a causative factor for around 40% of Mixed Lineage Leukemias (MLL) (Bernt et al., 2011; Chen and Armstrong, 2015; Guenther et al., 2008; Krivtsov et al., 2008). Despite multiple studies, the mechanism by which H2B-Ub stimulates Dot1L to methylate H3K79 remains unknown.", "[14] The information in the eukaryotic genome is accessed in the context of chromatin, a nucleoprotein complex consisting of DNA and histone proteins. The fundamental unit of chromatin, the nucleosome core particle, comprises about 147 base pairs of DNA wrapped around an octamer core containing two copies each of histones H2A, H2B, H3, and H4 [1]. Post-translational modifications of specific histone residues serve as an additional layer of “metadata” that regulates all processes requiring access to genomic DNA. Histone modifications play a central role in regulating transcription, with specific combinations of histone modifications associated with activation or repression of gene expression. These distinct patterns of modifications, known as the “histone code” [2], provide docking sites for the transcriptional machinery as well as additional chromatin-modifying enzymes, modulate nucleosome dynamics and likely play additional roles that are yet to be understood. Histone modifications also play an important role in mediating the response to DNA damage [3] and chromosome condensation during mitosis [4]. Proteins that govern the histone code can be categorized as histone “readers,” which bind to specific histone marks, “writers,” the enzymes that covalently attach the modifications, and “erasers,” the enzymes that remove the modifications. Correspondence: cwolberg@jhmi.edu. Publisher's Disclaimer: This is a PDF file of an unedited manuscript that has been accepted for publication. As a service to our customers we are providing this early version of the manuscript. The manuscript will undergo copyediting, typesetting, and review of the resulting proof before it is published in its final citable form. Please note that during the production process errors may be discovered which could affect the content, and all legal disclaimers that apply to the journal pertain. M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t Whereas most histone modifications consist of small chemical groups, histones can also be modified by the covalent attachment of the 76-amino acid protein, ubiquitin, to the ε-amino group of lysine [5,6]. Histone ubiquitination serves a signaling, rather than a degradative role, and its relatively large size and complexity distinguishes it from small side chain modifications such as acetylation, methylation, or phosphorylation. Ubiquitin is attached to specific lysine residues by a cascade of E1/E2/E3 conjugation machinery, with the E2/E3 pair conferring substrate specificity [7]. Ubiquitination of histone H2B, Lys120 (H2BK120ub) is enriched at actively transcribed genomic loci [8], whereas ubiquitin attached to histone H2A, Lys 119 (H2AK119ub) is a mark found in heterochromatic regions [9]. In response to DNA double strand breaks (DSBs), histone H2A is also ubiquitinated at K13/K15 (forming H2AK13ub or H2AK15ub, respectively), where this mark is required for recruiting the DSB repair machinery [10]. Histones H1, H3 and H4 have also been shown to be ubiquitinated in response to UV irradiation [11,12]. In many cases, there is “cross-talk” between histone ubiquitination and other types of histone modifications, with the ubiquitin mark either recognized in conjunction with specific marks such as methyl-lysine, or examples where histone ubiquitination is a prerequisite for deposition of other histone modifications such as methylation or acetylation [13–15].", "[15] Eukaryotic genomes are packaged into a nucleoprotein complex knows as chromatin, which organizes the genome within the confines of the nucleus and regulates access to DNA. The fundamental organizational unit of chromatin is the nucleosome, which comprises ~146 base pairs of duplex DNA wrapped around a protein core containing two copies each of histones H2A, H2B, H3 and H4 (Andrews & Luger, 2011). Histone proteins are decorated with post- translational modifications such as acetylation, methylation, and ubiquitination, forming a language of genomic metadata known as the histone code (Jenuwein & Allis, 2001). These histone marks are deposited by “writer” enzymes, “read” by other chromatin-binding proteins that bind to the histone mark and removed by “eraser” enzymes. The impracticality of purifying homogeneously modified histones from endogenous sources presents a barrier to biochemical and structural studies of individual histone modifications. Fortunately, semi- M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t M a n u s c r i p t synthetic protein chemistry methodologies have emerged to efficiently construct uniformly modified histone proteins. Small histone side-chain modifications such as acetylation, methylation, and phosphorylation can, in some cases, be mimicked by side-chain substitutions, incorporated using amber codon suppression (Chin et al., 2003) or introduced by assembly of peptides generated by solid-phase synthesis (Bondalapati, Jbara, & Brik, 2016). Site-specific incorporation of ubiquitin (Ub), however, represents a greater challenge, as it involves covalent attachment of the C-terminal carboxylate of the 76-amino acid Ub protein to a lysine residue via an amide (isopeptide) linkage (Holt & Muir, 2015; Jbara, Sun, Kamnesky, & Brik, 2018; Kumar, Spasser, Ohayon, Erlich, & Brik, 2011; Long, Furgason, & Yao, 2014). Histone H2B ubiquitinated at lysine 120 (in humans and X. laevis; lysine 123 in yeast) is a hallmark of actively transcribed genes and is required for histone H3K4 and H3K79 trimethylation (Weake & Workman, 2008) – two other marks of active transcription. H2B-Ub also plays a role in regulating nucleosome assembly during DNA replication to stimulate homologous recombination (HR) and replication fork progression, promoting DNA damage tolerance (Hung, Wong, Ulrich, & Kao, 2017). H2A monoubiquitinated at lysine 119, by contrast, is a mark of transcriptionally silent heterochromatin (Wang et al., 2004). Studies of the mechanism by which ubiquitinated nucleosomes interact with a variety of enzymes and other cellular proteins, as well as the effect of monoubiquitination on chromatin compaction, require methods for generating ubiquitinated nucleosomes at a scale and homogeneity that makes it possible to carry out in vitro biochemistry and structural studies. While this article focuses on methods to generate nucleosomes containing ubiquitinated histone H2B, these approaches also can be used to generate nucleosomes with H2A-Ub (Jbara, Laps, et al., 2018)."], "final_answer": "Modification type  \n•  Monoubiquitination of Lys-120 in human H2B (equivalent to Lys-123 in yeast) is the only well-documented PTM on this residue in the supplied literature. No acetyl- or methyl-lysine forms of K120 are described in the cited sources.  \n\nWriters and erasers  \n•  Writer Rad6 (E2) plus Bre1 in yeast / RAD6A-B plus RNF20–RNF40 in humans attach a single ubiquitin to K120 [1,4].  \n•  Erasers Two USP-family deubiquitinases remove the mark: Ubp8 (catalytic subunit of the SAGA DUB module; human orthologue = USP22) and Ubp10 (human orthologue = USP36) [1,5].  \n•  Structural work on the writer (Bre1–Rad6–nucleosome) shows one Bre1 RING domain docking on the nucleosome acidic patch to position Rad6 for K120 ubiquitylation, while the second RING contacts DNA, explaining residue specificity [4].  \n•  The 4-subunit SAGA DUB module forms an intertwined scaffold that holds Ubp8 in an active conformation for H2B-Ub cleavage [1].  \n\nReaders / downstream enzymes  \n•  Ubiquitin on K120 recruits or allosterically activates:  \n – FACT histone chaperone (promotes H2A/H2B eviction–reassembly) [1].  \n – COMPASS/MLL1 (H3K4 methylation) and DOT1L/Dot1 (H3K79 methylation) [1,3,13].  \n – Chd1 and other remodelers (stimulation or inhibition depends on remodeler) [8].  \n\nFunctional consequences for chromatin & transcription  \n•  Activation: H2BK120ub is a universal hallmark of actively transcribed genes; it promotes pre-initiation-complex assembly, stimulates elongation, and favours mRNA splicing/export [1,5,7].  \n•  Histone-mark crosstalk: the ubiquitin mark is prerequisite for H3K4me3 and H3K79me3 deposition, establishing an “activating” modification cascade [1,3,13].  \n•  DNA-templated processes: facilitates replication-fork progression and the DNA-damage response [1,2,7].  \n•  Chromatin architecture: cryo-EM plus MD show ubiquitin sits over the nucleosome acidic patch in several stable positions, physically blocking many acidic-patch binders (e.g., RCC1, LANA peptide, acidic-patch nanobodies). This “gatekeeper” role is unique to H2BK120ub and is not seen for H2AK119ub [2,8,11].  \n\nDynamics & developmental timing  \n•  H2BK120ub is highly dynamic; it is added and removed during each transcription cycle and changes through the cell cycle [2,7].  \n•  Loss of RNF20/40 or USP22 perturbs gene expression programmes in cancer cells, underscoring its importance in development and disease [4,7].  \n\nExperimental strategies that defined these features  \n•  Cryo-EM structures: writer complex on nucleosome [4]; nucleosomes bearing H2BK120ub alone or with DOT1L/COMPASS bound [2,3,13].  \n•  Molecular-dynamics simulations to map ubiquitin mobility on the nucleosome [2].  \n•  Semi-synthetic nucleosome reconstitution with site-specific ubiquitinated H2B for in-vitro biochemistry/structures [10,15].  \n•  Bottom-up and top-down mass spectrometry to catalogue histone PTMs, including ubiquitin conjugation status [12].  \n•  Genetic loss-of-function (Rad6/Bre1, Ubp8/Ubp10, RNF20/40, USP22/USP36) and transcriptome analyses to link the mark to transcriptional outcomes [5,7].  \n•  Binding assays showing inhibited interaction of acidic-patch binders with H2BK120-ubiquitin nucleosomes [2,11].  \n\nCell types / biological contexts  \n•  Detected across eukaryotes from yeast to humans at euchromatic, actively transcribed loci [1,2,5,6].  \n•  Enriched at transcription-start-site (+1) nucleosomes [7].  \n•  Up-regulated in response to DNA double-strand breaks and during S-phase replication fork passage [2,7].  \n\nComparison with H2AK119ub  \n•  Both marks are monoubiquitinations, yet they have opposite transcriptional outputs: H2BK120ub promotes activation and chromatin decompaction, whereas H2AK119ub is linked to PRC2-mediated repression and compaction. Only H2BK120ub sterically blocks the acidic patch, explaining their divergent effects on nucleosome interactors [2].", "citations": {"7": "10.1016/j.chembiol.2021.12.004.", "10": "10.1002/anie.201600638.", "12": "10.1002/jms.3198.", "6": "10.1016/j.sbi.2016.11.016.", "5": "10.7554/eLife.40988.001", "2": "10.1093/nar/gkae698", "15": "10.1016/bs.mie.2019.01.003.", "13": "10.1016/j.cell.2019.02.002.", "4": "10.1038/s41594-023-01137-x.", "3": "10.1016/j.sbi.2023.102649.", "11": "10.1093/nar/gkae698", "8": "10.1093/nar/gkae698", "1": "10.1126/science.aac5681."}}
